In [2]:
print('hello, world!')

hello, world!

because we are using submodules, there can be some issues importing packages from our exising kernel (which is built off the .toml file). so, we manually import them here.

In [3]:
import sys
absolute_path = '/Users/denver/Documents/semiotic/yode/sql/internal/autoSQL/autosql/autosql/eval/test-suite-sql-eval'
sys.path.append(absolute_path)

In [4]:
!pip install nltk
!pip install nest_asyncio

Requirement already satisfied: nltk in /Users/denver/Library/Caches/pypoetry/virtualenvs/autosql-zXeDcnW2-py3.11/lib/python3.11/site-packages (3.8.1)
Requirement already satisfied: click in /Users/denver/Library/Caches/pypoetry/virtualenvs/autosql-zXeDcnW2-py3.11/lib/python3.11/site-packages (from nltk) (8.1.7)
Requirement already satisfied: joblib in /Users/denver/Library/Caches/pypoetry/virtualenvs/autosql-zXeDcnW2-py3.11/lib/python3.11/site-packages (from nltk) (1.3.2)
Requirement already satisfied: regex>=2021.8.3 in /Users/denver/Library/Caches/pypoetry/virtualenvs/autosql-zXeDcnW2-py3.11/lib/python3.11/site-packages (from nltk) (2023.10.3)
Requirement already satisfied: tqdm in /Users/denver/Library/Caches/pypoetry/virtualenvs/autosql-zXeDcnW2-py3.11/lib/python3.11/site-packages (from nltk) (4.66.1)

[notice] A new release of pip is available: 23.2.1 -> 23.3
[notice] To update, run: pip install --upgrade pip
Requirement already satisfied: nest_asyncio in /Users/denver/Library/Caches/pypoetry/virtualenvs/autosql-zXeDcnW2-py3.11/lib/python3.11/site-packages (1.5.8)

[notice] A new release of pip is available: 23.2.1 -> 23.3
[notice] To update, run: pip install --upgrade pip

In [5]:
from datasets import Dataset, DatasetDict
import datasets

import os
import json
import asyncio
import nest_asyncio
nest_asyncio.apply()

from process_sql import get_schema, Schema, get_sql
from exec_eval import eval_exec_match
from evaluation import evaluate, build_foreign_key_map_from_json, Evaluator, build_valid_col_units, rebuild_sql_val, rebuild_sql_col, print_scores

In [5]:
ds = datasets.load_dataset('alagaesia/spider_dev')

Downloading readme:   0%|          | 0.00/1.46k [00:00<?, ?B/s]

Downloading data files:   0%|          | 0/1 [00:00<?, ?it/s]

Downloading data:   0%|          | 0.00/82.2k [00:00<?, ?B/s]

Extracting data files:   0%|          | 0/1 [00:00<?, ?it/s]

Generating train split:   0%|          | 0/1034 [00:00<?, ? examples/s]

we want to test that we can run the test suite eval and correctly report values. to do so, we are going to create a prediction value that should be 100% accurate, simply by replicating the gold as the prediction. this should give us a basic workflow for testing the test suite.

In [6]:
ds

DatasetDict({
    train: Dataset({
        features: ['db_id', 'query', 'question', 'create_w_keys', 'create_wo_keys', 'difficulty'],
        num_rows: 1034
    })
})

In [7]:
ds['train'][0]

{'db_id': 'concert_singer',
 'query': 'SELECT count(*) FROM singer',
 'question': 'How many singers do we have?',
 'create_w_keys': 'CREATE TABLE "stadium" ( "Stadium_ID" int, "Location" text, "Name" text, "Capacity" int, "Highest" int, "Lowest" int, "Average" int, PRIMARY KEY ("Stadium_ID") ); CREATE TABLE "singer" ( "Singer_ID" int, "Name" text, "Country" text, "Song_Name" text, "Song_release_year" text, "Age" int, "Is_male" bool, PRIMARY KEY ("Singer_ID") ); CREATE TABLE "concert" ( "concert_ID" int, "concert_Name" text, "Theme" text, "Stadium_ID" text, "Year" text, PRIMARY KEY ("concert_ID"), FOREIGN KEY ("Stadium_ID") REFERENCES "stadium"("Stadium_ID") ); CREATE TABLE "singer_in_concert" ( "concert_ID" int, "Singer_ID" text, PRIMARY KEY ("concert_ID","Singer_ID"), FOREIGN KEY ("concert_ID") REFERENCES "concert"("concert_ID"), FOREIGN KEY ("Singer_ID") REFERENCES "singer"("Singer_ID") ); ',
 'create_wo_keys': 'CREATE TABLE stadium (Stadium_ID INT, Location TEXT, Name TEXT, Capacity INT, Highest INT, Lowest INT, Average INT); CREATE TABLE singer (Singer_ID INT, Name TEXT, Country TEXT, Song_Name TEXT, Song_release_year TEXT, Age INT, Is_male bool); CREATE TABLE concert (concert_ID INT, concert_Name TEXT, Theme TEXT, Stadium_ID TEXT, Year TEXT); CREATE TABLE singer_in_concert (concert_ID INT, Singer_ID TEXT); ',
 'difficulty': 'easy'}

In [ ]:
evaluator = Evaluator()

In [ ]:
db = query = ds['train'][0]['db_id']
db

In [ ]:
db_path = os.path.join('test-suite-sql-eval/database', db, db + ".sqlite")

In [ ]:
schema = Schema(get_schema(db_path))

In [ ]:
query = ds['train'][0]['query']

g_sql = get_sql(schema, query)

evaluator.eval_hardness(g_sql)

In [ ]:
def hardness(
    db_id: str,
    query: str,
    evaluator: Evaluator,
): 
    
    db_path = os.path.join('test-suite-sql-eval/database', db_id, db_id + ".sqlite")
    schema = Schema(get_schema(db_path))

    g_sql = get_sql(schema, query)

    return evaluator.eval_hardness(g_sql)

def map_hardness(
    dataset: Dataset,
    db_id_column: str,
    query_column: str,
    evaluator: Evaluator,
): 
    
    db_id = dataset[db_id_column]
    query = dataset[query_column]

    print(db_id)
    print(query)

    level = hardness(db_id, query, evaluator)

    return {'difficulty': level}

#db = query = ds['train'][0]['db_id']
#query = ds['train'][0]['query']

#hardness(db, query, evaluator)

ds['train'] = ds['train'].map(map_hardness, fn_kwargs = {'db_id_column': 'db_id', 'query_column': 'query', 'evaluator': evaluator}, load_from_cache_file = False)

#ds = map_hardness(ds['train'], 'db_id', 'query', evaluator)

In [ ]:
ds['train'][370]

In [ ]:
ds.push_to_hub('alagaesia/spider_dev')

In [ ]:
ds

In [ ]:
diff = {}

for i in range(len(ds['train'])):

    if ds['train'][i]['difficulty'] in diff:
        diff[ds['train'][i]['difficulty']] += 1
    else:
        diff[ds['train'][i]['difficulty']] = 1

In [ ]:
diff

In [ ]:
with open('gold.txt', 'w') as file:

    for i in range(len(ds['train'])):

        query = ds['train'][i]['query']
        db_id = ds['train'][i]['db_id']

        file.write(f"{query}\t{db_id}\n")

In [ ]:
with open('predict.txt', 'w') as file:

    for i in range(len(ds['train'])):

        query = ds['train'][i]['query']
        #db_id = ds['train'][i]['db_id']

        file.write(f"{query}\n") # \t{db_id}

# clean up the prediction file

In [15]:
data = DatasetDict.load_from_disk('data_7b_predictions')

In [16]:
llama = DatasetDict.load_from_disk('llama_7b')

In [54]:
data = Dataset.load_from_disk('all_predictions')

In [55]:
data

Dataset({
    features: ['db_id', 'query', 'question', 'create_w_keys', 'create_wo_keys', 'difficulty', 'zero_shot_request', 'defog_sqlcoder_7b', 'defog_sqlcoder_7b_latency', 'mistral_7b_instruct', 'mistral_7b_instruct_latency', 'llama_7b', 'llama_7b_latency', 'zero_shot_request_complex', 'mistral_7b_instruct_complex', 'mistral_7b_instruct_complex_latency', 'defog_sqlcoder_7b_complex', 'defog_sqlcoder_7b_complex_latency', 'llama_7b_complex', 'llama_7b_complex_latency', 'gpt_3_5_complex', 'gpt_3_5'],
    num_rows: 209
})

In [56]:
from typing import Optional
import re

def dep_response_parser(
        prediction: str,
    ): 
         
        pattern = r"SELECT.*?(?=\n|\[/|,\[INST\])"
        matches = re.findall(pattern, prediction, re.DOTALL)

        return matches

def response_parser(prediction: str):

    prediction = prediction.replace('\n', ' ')
    prediction = prediction.replace('\t', ' ')

    pattern = r"\bSELECT\b.*?(?=;|\n|#|\[/|,\[INST\]|$)"
    matches = re.findall(pattern, prediction, re.DOTALL | re.IGNORECASE)

    matches = [match.strip() for match in matches if match.strip()]

    if len(matches) == 0:
        return ''
    else:
        return matches[0]

    #return matches[0]

def dataset_response_parser(
        dataset,
        prediction_column: str,
        result_label: Optional[str] = None,
    ): 
        
        prediction = dataset[prediction_column]
         
        #pattern = r"SELECT.*?(?=\n|\[/|,\[INST\])"
        #matches = re.findall(pattern, prediction, re.DOTALL)

        matches = response_parser(prediction)

        if result_label is None: 
            result_label = prediction_column + '_cleaned'

        return {result_label: matches}

In [57]:
data = data.map(dataset_response_parser, fn_kwargs = {'prediction_column': 'llama_7b_complex'}, load_from_cache_file = False)

Map:   0%|          | 0/209 [00:00<?, ? examples/s]

In [58]:
data = data.map(dataset_response_parser, fn_kwargs = {'prediction_column': 'llama_7b'}, load_from_cache_file = False)

Map:   0%|          | 0/209 [00:00<?, ? examples/s]

In [59]:
data = data.map(dataset_response_parser, fn_kwargs = {'prediction_column': 'defog_sqlcoder_7b_complex'}, load_from_cache_file = False)

Map:   0%|          | 0/209 [00:00<?, ? examples/s]

In [60]:
data = data.map(dataset_response_parser, fn_kwargs = {'prediction_column': 'defog_sqlcoder_7b'}, load_from_cache_file = False)

Map:   0%|          | 0/209 [00:00<?, ? examples/s]

In [61]:
data = data.map(dataset_response_parser, fn_kwargs = {'prediction_column': 'mistral_7b_instruct_complex'}, load_from_cache_file = False)

Map:   0%|          | 0/209 [00:00<?, ? examples/s]

In [62]:
data = data.map(dataset_response_parser, fn_kwargs = {'prediction_column': 'mistral_7b_instruct'}, load_from_cache_file = False)

Map:   0%|          | 0/209 [00:00<?, ? examples/s]

In [65]:
data.save_to_disk('all_predictions_cleaned')

Saving the dataset (0/1 shards):   0%|          | 0/209 [00:00<?, ? examples/s]

#

# Evaluate with the test suite

In [67]:
with open('gold.txt', 'w') as file:

    for i in range(len(data)):

        query = data[i]['query']
        db_id = data[i]['db_id']

        file.write(f"{query}\t{db_id}\n")

In [78]:
with open('llama_7b_complex_predict.txt', 'w') as file:

    for i in range(len(data)):

        query = data[i]['llama_7b_complex_cleaned']
        
        if query == '':
            query = 'SELECT'

        file.write(f"{query}\n") # \t{db_id}

In [80]:


with open('llama_7b_predict.txt', 'w') as file:

    for i in range(len(data)):

        query = data[i]['llama_7b_cleaned']

        if query == '':
            query = 'SELECT'

        file.write(f"{query}\n") # \t{db_id}

with open('defog_sqlcoder_7b_complex_predict.txt', 'w') as file:

    for i in range(len(data)):

        query = data[i]['defog_sqlcoder_7b_complex_cleaned']

        if query == '':
            query = 'SELECT'

        file.write(f"{query}\n") # \t{db_id}

with open('defog_sqlcoder_7b_predict.txt', 'w') as file:

    for i in range(len(data)):

        query = data[i]['defog_sqlcoder_7b_cleaned']

        if query == '':
            query = 'SELECT'

        file.write(f"{query}\n") # \t{db_id}

with open('mistral_7b_instruct_complex_predict.txt', 'w') as file:

    for i in range(len(data)):

        query = data[i]['mistral_7b_instruct_complex_cleaned']

        if query == '':
            query = 'SELECT'

        file.write(f"{query}\n") # \t{db_id}

with open('mistral_7b_instruct_predict.txt', 'w') as file:

    for i in range(len(data)):

        query = data[i]['mistral_7b_instruct_cleaned']

        if query == '':
            query = 'SELECT'

        file.write(f"{query}\n") # \t{db_id}

In [73]:
data[110]

{'db_id': 'student_transcripts_tracking',
 'query': 'SELECT line_1 ,  line_2 FROM addresses',
 'question': 'what are all the addresses including line 1 and line 2?',
 'create_w_keys': 'CREATE TABLE `Addresses` ( `address_id` INTEGER PRIMARY KEY, `line_1` VARCHAR(255), `line_2` VARCHAR(255), `line_3` VARCHAR(255), `city` VARCHAR(255), `zip_postcode` VARCHAR(20), `state_province_county` VARCHAR(255), `country` VARCHAR(255), `other_address_details` VARCHAR(255) ); CREATE TABLE `Courses` ( `course_id` INTEGER PRIMARY KEY, `course_name` VARCHAR(255), `course_description` VARCHAR(255), `other_details` VARCHAR(255) ); CREATE TABLE `Departments` ( `department_id` INTEGER PRIMARY KEY, `department_name` VARCHAR(255), `department_description` VARCHAR(255), `other_details` VARCHAR(255) ); CREATE TABLE `Degree_Programs` ( `degree_program_id` INTEGER PRIMARY KEY, `department_id` INTEGER NOT NULL, `degree_summary_name` VARCHAR(255), `degree_summary_description` VARCHAR(255), `other_details` VARCHAR(255), FOREIGN KEY (`department_id` ) REFERENCES `Departments`(`department_id` ) ); CREATE TABLE `Sections` ( `section_id` INTEGER PRIMARY KEY, `course_id` INTEGER NOT NULL, `section_name` VARCHAR(255), `section_description` VARCHAR(255), `other_details` VARCHAR(255), FOREIGN KEY (`course_id` ) REFERENCES `Courses`(`course_id` ) ); CREATE TABLE `Semesters` ( `semester_id` INTEGER PRIMARY KEY, `semester_name` VARCHAR(255), `semester_description` VARCHAR(255), `other_details` VARCHAR(255) ); CREATE TABLE `Students` ( `student_id` INTEGER PRIMARY KEY, `current_address_id` INTEGER NOT NULL, `permanent_address_id` INTEGER NOT NULL, `first_name` VARCHAR(80), `middle_name` VARCHAR(40), `last_name` VARCHAR(40), `cell_mobile_number` VARCHAR(40), `email_address` VARCHAR(40), `ssn` VARCHAR(40), `date_first_registered` DATETIME, `date_left` DATETIME, `other_student_details` VARCHAR(255), FOREIGN KEY (`current_address_id` ) REFERENCES `Addresses`(`address_id` ), FOREIGN KEY (`permanent_address_id` ) REFERENCES `Addresses`(`address_id` ) ); CREATE TABLE `Student_Enrolment` ( `student_enrolment_id` INTEGER PRIMARY KEY, `degree_program_id` INTEGER NOT NULL, `semester_id` INTEGER NOT NULL, `student_id` INTEGER NOT NULL, `other_details` VARCHAR(255), FOREIGN KEY (`degree_program_id` ) REFERENCES `Degree_Programs`(`degree_program_id` ), FOREIGN KEY (`semester_id` ) REFERENCES `Semesters`(`semester_id` ), FOREIGN KEY (`student_id` ) REFERENCES `Students`(`student_id` ) ); CREATE TABLE `Student_Enrolment_Courses` ( `student_course_id` INTEGER PRIMARY KEY, `course_id` INTEGER NOT NULL, `student_enrolment_id` INTEGER NOT NULL, FOREIGN KEY (`course_id` ) REFERENCES `Courses`(`course_id` ), FOREIGN KEY (`student_enrolment_id` ) REFERENCES `Student_Enrolment`(`student_enrolment_id` ) ); CREATE TABLE `Transcripts` ( `transcript_id` INTEGER PRIMARY KEY, `transcript_date` DATETIME, `other_details` VARCHAR(255) ); CREATE TABLE `Transcript_Contents` ( `student_course_id` INTEGER NOT NULL, `transcript_id` INTEGER NOT NULL, FOREIGN KEY (`student_course_id` ) REFERENCES `Student_Enrolment_Courses`(`student_course_id` ), FOREIGN KEY (`transcript_id` ) REFERENCES `Transcripts`(`transcript_id` ) ); ',
 'create_wo_keys': 'CREATE TABLE Addresses (address_id INTEGER, line_1 VARCHAR(255), line_2 VARCHAR(255), line_3 VARCHAR(255), city VARCHAR(255), zip_postcode VARCHAR(20), state_province_county VARCHAR(255), country VARCHAR(255), other_address_details VARCHAR(255)); CREATE TABLE Courses (course_id INTEGER, course_name VARCHAR(255), course_description VARCHAR(255), other_details VARCHAR(255)); CREATE TABLE Departments (department_id INTEGER, department_name VARCHAR(255), department_description VARCHAR(255), other_details VARCHAR(255)); CREATE TABLE Degree_Programs (degree_program_id INTEGER, department_id INTEGER, degree_summary_name VARCHAR(255), degree_summary_description VARCHAR(255), other_details VARCHAR(255)); CREATE TABLE Sections (section_id INTEGER, course_id INTEGER, section_name VARCHAR(255), section_description VARCHAR(255), other_details VARCHAR(255)); CREATE TABLE Semesters (semester_id INTEGER, semester_name VARCHAR(255), semester_description VARCHAR(255), other_details VARCHAR(255)); CREATE TABLE Students (student_id INTEGER, current_address_id INTEGER, permanent_address_id INTEGER, first_name VARCHAR(80), middle_name VARCHAR(40), last_name VARCHAR(40), cell_mobile_number VARCHAR(40), email_address VARCHAR(40), ssn VARCHAR(40), date_first_registered DATETIME, date_left DATETIME, other_student_details VARCHAR(255)); CREATE TABLE Student_Enrolment (student_enrolment_id INTEGER, degree_program_id INTEGER, semester_id INTEGER, student_id INTEGER, other_details VARCHAR(255)); CREATE TABLE Student_Enrolment_Courses (student_course_id INTEGER, course_id INTEGER, student_enrolment_id INTEGER); CREATE TABLE Transcripts (transcript_id INTEGER, transcript_date DATETIME, other_details VARCHAR(255)); CREATE TABLE Transcript_Contents (student_course_id INTEGER, transcript_id INTEGER); ',
 'difficulty': 'medium',
 'zero_shot_request': 'Provide the SQL query that answers the QUESTION, with no explanation or special characters. CONTEXT: Relevant SQL tables, with their properties: CREATE TABLE `Addresses` ( `address_id` INTEGER PRIMARY KEY, `line_1` VARCHAR(255), `line_2` VARCHAR(255), `line_3` VARCHAR(255), `city` VARCHAR(255), `zip_postcode` VARCHAR(20), `state_province_county` VARCHAR(255), `country` VARCHAR(255), `other_address_details` VARCHAR(255) ); CREATE TABLE `Courses` ( `course_id` INTEGER PRIMARY KEY, `course_name` VARCHAR(255), `course_description` VARCHAR(255), `other_details` VARCHAR(255) ); CREATE TABLE `Departments` ( `department_id` INTEGER PRIMARY KEY, `department_name` VARCHAR(255), `department_description` VARCHAR(255), `other_details` VARCHAR(255) ); CREATE TABLE `Degree_Programs` ( `degree_program_id` INTEGER PRIMARY KEY, `department_id` INTEGER NOT NULL, `degree_summary_name` VARCHAR(255), `degree_summary_description` VARCHAR(255), `other_details` VARCHAR(255), FOREIGN KEY (`department_id` ) REFERENCES `Departments`(`department_id` ) ); CREATE TABLE `Sections` ( `section_id` INTEGER PRIMARY KEY, `course_id` INTEGER NOT NULL, `section_name` VARCHAR(255), `section_description` VARCHAR(255), `other_details` VARCHAR(255), FOREIGN KEY (`course_id` ) REFERENCES `Courses`(`course_id` ) ); CREATE TABLE `Semesters` ( `semester_id` INTEGER PRIMARY KEY, `semester_name` VARCHAR(255), `semester_description` VARCHAR(255), `other_details` VARCHAR(255) ); CREATE TABLE `Students` ( `student_id` INTEGER PRIMARY KEY, `current_address_id` INTEGER NOT NULL, `permanent_address_id` INTEGER NOT NULL, `first_name` VARCHAR(80), `middle_name` VARCHAR(40), `last_name` VARCHAR(40), `cell_mobile_number` VARCHAR(40), `email_address` VARCHAR(40), `ssn` VARCHAR(40), `date_first_registered` DATETIME, `date_left` DATETIME, `other_student_details` VARCHAR(255), FOREIGN KEY (`current_address_id` ) REFERENCES `Addresses`(`address_id` ), FOREIGN KEY (`permanent_address_id` ) REFERENCES `Addresses`(`address_id` ) ); CREATE TABLE `Student_Enrolment` ( `student_enrolment_id` INTEGER PRIMARY KEY, `degree_program_id` INTEGER NOT NULL, `semester_id` INTEGER NOT NULL, `student_id` INTEGER NOT NULL, `other_details` VARCHAR(255), FOREIGN KEY (`degree_program_id` ) REFERENCES `Degree_Programs`(`degree_program_id` ), FOREIGN KEY (`semester_id` ) REFERENCES `Semesters`(`semester_id` ), FOREIGN KEY (`student_id` ) REFERENCES `Students`(`student_id` ) ); CREATE TABLE `Student_Enrolment_Courses` ( `student_course_id` INTEGER PRIMARY KEY, `course_id` INTEGER NOT NULL, `student_enrolment_id` INTEGER NOT NULL, FOREIGN KEY (`course_id` ) REFERENCES `Courses`(`course_id` ), FOREIGN KEY (`student_enrolment_id` ) REFERENCES `Student_Enrolment`(`student_enrolment_id` ) ); CREATE TABLE `Transcripts` ( `transcript_id` INTEGER PRIMARY KEY, `transcript_date` DATETIME, `other_details` VARCHAR(255) ); CREATE TABLE `Transcript_Contents` ( `student_course_id` INTEGER NOT NULL, `transcript_id` INTEGER NOT NULL, FOREIGN KEY (`student_course_id` ) REFERENCES `Student_Enrolment_Courses`(`student_course_id` ), FOREIGN KEY (`transcript_id` ) REFERENCES `Transcripts`(`transcript_id` ) );  QUESTION: what are all the addresses including line 1 and line 2? ',
 'defog_sqlcoder_7b': 'INVESTIGATE',
 'defog_sqlcoder_7b_latency': 0.1055290699005127,
 'mistral_7b_instruct': 'INVESTIGATE',
 'mistral_7b_instruct_latency': 0.11330008506774902,
 'llama_7b': 'INVESTIGATE',
 'llama_7b_latency': 0.07906603813171387,
 'zero_shot_request_complex': '### Complete sqlite SQL query only and with no explanation, and do not select extra columns that are not explicitly requested in the query.\n ### Sqlite SQL tables, with their properties:\n #\n #  CREATE TABLE `Addresses` ( `address_id` INTEGER PRIMARY KEY, `line_1` VARCHAR(255), `line_2` VARCHAR(255), `line_3` VARCHAR(255), `city` VARCHAR(255), `zip_postcode` VARCHAR(20), `state_province_county` VARCHAR(255), `country` VARCHAR(255), `other_address_details` VARCHAR(255) ); CREATE TABLE `Courses` ( `course_id` INTEGER PRIMARY KEY, `course_name` VARCHAR(255), `course_description` VARCHAR(255), `other_details` VARCHAR(255) ); CREATE TABLE `Departments` ( `department_id` INTEGER PRIMARY KEY, `department_name` VARCHAR(255), `department_description` VARCHAR(255), `other_details` VARCHAR(255) ); CREATE TABLE `Degree_Programs` ( `degree_program_id` INTEGER PRIMARY KEY, `department_id` INTEGER NOT NULL, `degree_summary_name` VARCHAR(255), `degree_summary_description` VARCHAR(255), `other_details` VARCHAR(255), FOREIGN KEY (`department_id` ) REFERENCES `Departments`(`department_id` ) ); CREATE TABLE `Sections` ( `section_id` INTEGER PRIMARY KEY, `course_id` INTEGER NOT NULL, `section_name` VARCHAR(255), `section_description` VARCHAR(255), `other_details` VARCHAR(255), FOREIGN KEY (`course_id` ) REFERENCES `Courses`(`course_id` ) ); CREATE TABLE `Semesters` ( `semester_id` INTEGER PRIMARY KEY, `semester_name` VARCHAR(255), `semester_description` VARCHAR(255), `other_details` VARCHAR(255) ); CREATE TABLE `Students` ( `student_id` INTEGER PRIMARY KEY, `current_address_id` INTEGER NOT NULL, `permanent_address_id` INTEGER NOT NULL, `first_name` VARCHAR(80), `middle_name` VARCHAR(40), `last_name` VARCHAR(40), `cell_mobile_number` VARCHAR(40), `email_address` VARCHAR(40), `ssn` VARCHAR(40), `date_first_registered` DATETIME, `date_left` DATETIME, `other_student_details` VARCHAR(255), FOREIGN KEY (`current_address_id` ) REFERENCES `Addresses`(`address_id` ), FOREIGN KEY (`permanent_address_id` ) REFERENCES `Addresses`(`address_id` ) ); CREATE TABLE `Student_Enrolment` ( `student_enrolment_id` INTEGER PRIMARY KEY, `degree_program_id` INTEGER NOT NULL, `semester_id` INTEGER NOT NULL, `student_id` INTEGER NOT NULL, `other_details` VARCHAR(255), FOREIGN KEY (`degree_program_id` ) REFERENCES `Degree_Programs`(`degree_program_id` ), FOREIGN KEY (`semester_id` ) REFERENCES `Semesters`(`semester_id` ), FOREIGN KEY (`student_id` ) REFERENCES `Students`(`student_id` ) ); CREATE TABLE `Student_Enrolment_Courses` ( `student_course_id` INTEGER PRIMARY KEY, `course_id` INTEGER NOT NULL, `student_enrolment_id` INTEGER NOT NULL, FOREIGN KEY (`course_id` ) REFERENCES `Courses`(`course_id` ), FOREIGN KEY (`student_enrolment_id` ) REFERENCES `Student_Enrolment`(`student_enrolment_id` ) ); CREATE TABLE `Transcripts` ( `transcript_id` INTEGER PRIMARY KEY, `transcript_date` DATETIME, `other_details` VARCHAR(255) ); CREATE TABLE `Transcript_Contents` ( `student_course_id` INTEGER NOT NULL, `transcript_id` INTEGER NOT NULL, FOREIGN KEY (`student_course_id` ) REFERENCES `Student_Enrolment_Courses`(`student_course_id` ), FOREIGN KEY (`transcript_id` ) REFERENCES `Transcripts`(`transcript_id` ) );  \n #\n ###  what are all the addresses including line 1 and line 2? \n SQL QUERY:',
 'mistral_7b_instruct_complex': 'INVESTIGATE',
 'mistral_7b_instruct_complex_latency': 0.09964799880981445,
 'defog_sqlcoder_7b_complex': 'INVESTIGATE',
 'defog_sqlcoder_7b_complex_latency': 0.0830850601196289,
 'llama_7b_complex': 'INVESTIGATE',
 'llama_7b_complex_latency': 0.11321091651916504,
 'gpt_3_5_complex': {'choices': [{'finish_reason': 'stop',
    'index': 0,
    'message': {'content': 'SELECT line_1, line_2 FROM Addresses;',
     'role': 'assistant'}}],
  'created': 1698206864,
  'id': 'chatcmpl-8DPTENk4ydjoTi3eEqs4MxkfQyVuo',
  'model': 'gpt-3.5-turbo-0613',
  'object': 'chat.completion',
  'usage': {'completion_tokens': 11,
   'prompt_tokens': 854,
   'total_tokens': 865}},
 'gpt_3_5': {'choices': [{'finish_reason': 'stop',
    'index': 0,
    'message': {'content': 'SELECT line_1, line_2 FROM Addresses;',
     'role': 'assistant'}}],
  'created': 1698231720,
  'id': 'chatcmpl-8DVw8jRmg6Xp9hg1Cp4nYp0nVMGDu',
  'model': 'gpt-3.5-turbo-0613',
  'object': 'chat.completion',
  'usage': {'completion_tokens': 11,
   'prompt_tokens': 837,
   'total_tokens': 848}},
 'llama_7b_complex_cleaned': '',
 'llama_7b_cleaned': '',
 'defog_sqlcoder_7b_complex_cleaned': '',
 'defog_sqlcoder_7b_cleaned': '',
 'mistral_7b_instruct_complex_cleaned': '',
 'mistral_7b_instruct_cleaned': ''}

In [90]:
# evaluate(args.gold, args.pred, args.db, args.etype, kmaps, args.plug_value, args.keep_distinct, args.progress_bar_for_each_datapoint)
# python3 evaluation.py --gold evaluation_examples/gold.txt --pred evaluation_examples/predict.txt --etype all --db database/ --table tables.json --plug_value --keep_distinct --progress_bar_for_each_datapoint

gold_path = "gold.txt"
pred_path = "llama_7b_complex_predict.txt"
db_dir = "draft/database/"
table_path = "draft/tables.json"
etype = "all"
plug_value = False
keep_distinct = True
progress_bar_for_each_datapoint = False

llama_7b_pred_path = "llama_7b_predict.txt"
llama_7b_complex_pred_path = "llama_7b_complex_predict.txt"
defog_sqlcoder_7b_pred_path = "defog_sqlcoder_7b_predict.txt"
defog_sqlcoder_7b_complex_pred_path = "defog_sqlcoder_7b_complex_predict.txt"
mistral_7b_instruct_pred_path = "mistral_7b_instruct_predict.txt"
mistral_7b_instruct_complex_pred_path = "mistral_7b_instruct_complex_predict.txt"

if etype in ['all', 'match']:
    kmaps = build_foreign_key_map_from_json(table_path)
else:
    kmaps = None

In [91]:
llama_7b_scores = await evaluate(gold_path, llama_7b_pred_path, db_dir, etype, kmaps, plug_value, keep_distinct, progress_bar_for_each_datapoint)

easy pred: SELECT
easy gold: SELECT count(*) FROM singer

medium pred: SELECT
medium gold: SELECT name ,  country ,  age FROM singer ORDER BY age DESC

medium pred: SELECT
medium gold: SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'

medium pred: SELECT
medium gold: SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1

easy pred: SELECT
easy gold: SELECT DISTINCT country FROM singer WHERE age  >  20

hard pred: SELECT
hard gold: SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)

extra pred: SELECT
extra gold: SELECT T2.name ,  T2.capacity FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  >=  2014 GROUP BY T2.stadium_id ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT
extra gold: select t2.name ,  t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id  =  t2.stadium_id where t1.year  >  2013 group by t2.stadium_id order by count(*) desc limit 1

hard pred: SELECT
hard gold: SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT
hard gold: SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)

extra pred: SELECT
extra gold: SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015

easy pred: SELECT
easy gold: SELECT count(*) FROM pets WHERE weight  >  10

medium pred: SELECT
medium gold: SELECT weight FROM pets ORDER BY pet_age LIMIT 1

medium pred: SELECT
medium gold: SELECT max(weight) ,  petType FROM pets GROUP BY petType

medium pred: SELECT
medium gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20

hard pred: SELECT
hard gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'

easy pred: SELECT
easy gold: SELECT count(DISTINCT pettype) FROM pets

extra pred: SELECT
extra gold: SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'

extra pred: SELECT
extra gold: select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat' intersect select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'dog'

extra pred: SELECT
extra gold: SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog'

hard pred: SELECT
hard gold: SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'

hard pred: SELECT
hard gold: SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'

easy pred: SELECT
easy gold: SELECT count(*) FROM CONTINENTS;

medium pred: SELECT
medium gold: SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;

easy pred: SELECT
easy gold: SELECT count(*) FROM COUNTRIES;

medium pred: SELECT
medium gold: SELECT T1.FullName ,  T1.Id ,  count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id;

hard pred: SELECT
hard gold: SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1;

extra pred: SELECT
extra gold: SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.Weight  <  (SELECT avg(Weight) FROM CARS_DATA)

extra pred: SELECT
extra gold: SELECT DISTINCT T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker JOIN CAR_NAMES AS T3 ON T2.model  =  T3.model JOIN CARS_DATA AS T4 ON T3.MakeId  =  T4.id WHERE T4.year  =  '1970';

extra pred: SELECT
extra gold: SELECT T2.Make ,  T1.Year FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T1.Year  =  (SELECT min(YEAR) FROM CARS_DATA);

hard pred: SELECT
hard gold: SELECT DISTINCT T1.model FROM MODEL_LIST AS T1 JOIN CAR_NAMES AS T2 ON T1.model  =  T2.model JOIN CARS_DATA AS T3 ON T2.MakeId  =  T3.id WHERE T3.year  >  1980;

hard pred: SELECT
hard gold: SELECT T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.continent JOIN car_makers AS T3 ON T2.CountryId  =  T3.Country GROUP BY T1.Continent;

medium pred: SELECT
medium gold: select count(*) ,  t2.fullname from model_list as t1 join car_makers as t2 on t1.maker  =  t2.id group by t2.id;

easy pred: SELECT
easy gold: SELECT avg(mpg) FROM CARS_DATA WHERE Cylinders  =  4;

easy pred: SELECT
easy gold: SELECT Country FROM AIRLINES WHERE Airline  =  "JetBlue Airways"

easy pred: SELECT
easy gold: SELECT Abbreviation FROM AIRLINES WHERE Airline  =  "JetBlue Airways"

medium pred: SELECT
medium gold: SELECT Airline ,  Abbreviation FROM AIRLINES WHERE Country  =  "USA"

medium pred: SELECT
medium gold: SELECT AirportCode ,  AirportName FROM AIRPORTS WHERE city  =  "Anthony"

easy pred: SELECT
easy gold: SELECT count(*) FROM AIRLINES

medium pred: SELECT
medium gold: SELECT City ,  Country FROM AIRPORTS WHERE AirportName  =  "Alton"

hard pred: SELECT
hard gold: SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport  =  T3.AirportCode WHERE T2.City  =  "Ashley" AND T3.City  =  "Aberdeen"

hard pred: SELECT
hard gold: SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode JOIN AIRLINES AS T3 ON T3.uid  =  T1.Airline WHERE T2.City  =  "Aberdeen" AND T3.Airline  =  "United Airlines"

extra pred: SELECT
extra gold: SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport GROUP BY T1.City ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT
extra gold: SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.SourceAirport GROUP BY T1.City ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT
extra gold: SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport OR T1.AirportCode  =  T2.SourceAirport GROUP BY T1.AirportCode ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT
hard gold: SELECT count(*) FROM Flights AS T1 JOIN Airports AS T2 ON T1.DestAirport  =  T2.AirportCode WHERE T2.city  =  "Aberdeen" OR T2.city  =  "Abilene"

easy pred: SELECT
easy gold: SELECT count(*) FROM employee

easy pred: SELECT
easy gold: SELECT name FROM employee ORDER BY age

medium pred: SELECT
medium gold: SELECT count(*) ,  city FROM employee GROUP BY city

medium pred: SELECT
medium gold: SELECT city FROM employee WHERE age  <  30 GROUP BY city HAVING count(*)  >  1

medium pred: SELECT
medium gold: SELECT count(*) ,  LOCATION FROM shop GROUP BY LOCATION

hard pred: SELECT
hard gold: SELECT name FROM shop WHERE number_products  >  (SELECT avg(number_products) FROM shop)

extra pred: SELECT
extra gold: SELECT t1.name FROM employee AS t1 JOIN evaluation AS t2 ON t1.Employee_ID  =  t2.Employee_ID GROUP BY t2.Employee_ID ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT
hard gold: SELECT t1.name FROM employee AS t1 JOIN evaluation AS t2 ON t1.Employee_ID  =  t2.Employee_ID ORDER BY t2.bonus DESC LIMIT 1

hard pred: SELECT
hard gold: SELECT name FROM employee WHERE Employee_ID NOT IN (SELECT Employee_ID FROM evaluation)

extra pred: SELECT
extra gold: SELECT t2.name FROM hiring AS t1 JOIN shop AS t2 ON t1.shop_id  =  t2.shop_id GROUP BY t1.shop_id ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT
easy gold: SELECT sum(bonus) FROM evaluation

easy pred: SELECT
easy gold: SELECT count(*) FROM Documents

medium pred: SELECT
medium gold: SELECT document_id ,  document_name ,  document_description FROM Documents

medium pred: SELECT
medium gold: SELECT document_name ,  template_id FROM Documents WHERE Document_Description LIKE "%w%"

medium pred: SELECT
medium gold: SELECT document_id ,  template_id ,  Document_Description FROM Documents WHERE document_name  =  "Robbin CV"

easy pred: SELECT
easy gold: SELECT count(DISTINCT template_id) FROM Documents

extra pred: SELECT
extra gold: SELECT T1.template_id ,  T2.Template_Type_Code FROM Documents AS T1 JOIN Templates AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_id ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT
easy gold: SELECT template_id FROM Documents GROUP BY template_id HAVING count(*)  >  1

hard pred: SELECT
hard gold: SELECT template_id FROM Templates EXCEPT SELECT template_id FROM Documents

hard pred: SELECT
hard gold: SELECT template_type_code FROM Templates GROUP BY template_type_code ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT
extra gold: SELECT T1.template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_type_code ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT
hard gold: SELECT template_type_code FROM Templates EXCEPT SELECT template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id

extra pred: SELECT
extra gold: SELECT T1.document_id ,  T2.document_name FROM Paragraphs AS T1 JOIN Documents AS T2 ON T1.document_id  =  T2.document_id GROUP BY T1.document_id ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT
easy gold: SELECT count(*) FROM teacher

easy pred: SELECT
easy gold: SELECT Name FROM teacher ORDER BY Age ASC

medium pred: SELECT
medium gold: SELECT Age ,  Hometown FROM teacher

easy pred: SELECT
easy gold: select name from teacher where hometown != "little lever urban district"

medium pred: SELECT
medium gold: SELECT Name FROM teacher WHERE Age  =  32 OR Age  =  33

medium pred: SELECT
medium gold: SELECT Hometown FROM teacher ORDER BY Age ASC LIMIT 1

hard pred: SELECT
hard gold: SELECT Hometown FROM teacher GROUP BY Hometown ORDER BY COUNT(*) DESC LIMIT 1

hard pred: SELECT
hard gold: SELECT T3.Name ,  T2.Course FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID ORDER BY T3.Name

hard pred: SELECT
hard gold: SELECT T3.Name FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID WHERE T2.Course  =  "Math"

easy pred: SELECT
easy gold: SELECT count(*) FROM visitor WHERE age  <  30

medium pred: SELECT
medium gold: SELECT name FROM visitor WHERE Level_of_membership  >  4 ORDER BY Level_of_membership DESC

easy pred: SELECT
easy gold: SELECT avg(age) FROM visitor WHERE Level_of_membership  <=  4

medium pred: SELECT
medium gold: SELECT name ,  Level_of_membership FROM visitor WHERE Level_of_membership  >  4 ORDER BY age DESC

medium pred: SELECT
medium gold: SELECT museum_id ,  name FROM museum ORDER BY num_of_staff DESC LIMIT 1

easy pred: SELECT
easy gold: SELECT avg(num_of_staff) FROM museum WHERE open_year  <  2009

hard pred: SELECT
hard gold: SELECT name FROM museum WHERE num_of_staff  >  (SELECT min(num_of_staff) FROM museum WHERE open_year  >  2010)

extra pred: SELECT
extra gold: SELECT t2.visitor_id ,  t1.name ,  t1.Level_of_membership FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id GROUP BY t2.visitor_id ORDER BY sum(t2.Total_spent) DESC LIMIT 1

extra pred: SELECT
extra gold: SELECT t2.Museum_ID ,  t1.name FROM museum AS t1 JOIN visit AS t2 ON t1.Museum_ID  =  t2.Museum_ID GROUP BY t2.Museum_ID ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT
hard gold: SELECT name FROM museum WHERE Museum_ID NOT IN (SELECT museum_id FROM visit)

hard pred: SELECT
hard gold: SELECT t1.name ,  t1.age FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id ORDER BY t2.num_of_ticket DESC LIMIT 1

extra pred: SELECT
extra gold: SELECT t1.name FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id JOIN museum AS t3 ON t3.Museum_ID  =  t2.Museum_ID WHERE t3.open_year  <  2009 INTERSECT SELECT t1.name FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id JOIN museum AS t3 ON t3.Museum_ID  =  t2.Museum_ID WHERE t3.open_year  >  2011

easy pred: SELECT
easy gold: SELECT count(*) FROM players

easy pred: SELECT
easy gold: SELECT count(*) FROM matches

medium pred: SELECT
medium gold: SELECT first_name ,  birth_date FROM players WHERE country_code  =  'USA'

medium pred: SELECT
medium gold: SELECT avg(loser_age) ,  avg(winner_age) FROM matches

easy pred: SELECT
easy gold: SELECT avg(winner_rank) FROM matches

hard pred: SELECT
hard gold: SELECT winner_name FROM matches WHERE YEAR  =  2013 INTERSECT SELECT winner_name FROM matches WHERE YEAR  =  2016

medium pred: SELECT
medium gold: SELECT count(*) FROM matches WHERE YEAR  =  2013 OR YEAR  =  2016

extra pred: SELECT
extra gold: SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN matches AS T2 ON T1.player_id  =  T2.winner_id WHERE T2.tourney_name  =  'WTA Championships' INTERSECT SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN matches AS T2 ON T1.player_id  =  T2.winner_id WHERE T2.tourney_name  =  'Australian Open'

hard pred: SELECT
hard gold: SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN rankings AS T2 ON T1.player_id  =  T2.player_id ORDER BY T2.tours DESC LIMIT 1

hard pred: SELECT
hard gold: SELECT YEAR FROM matches GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT
easy gold: SELECT count(*) FROM ship WHERE disposition_of_ship  =  'Captured'

medium pred: SELECT
medium gold: SELECT name ,  tonnage FROM ship ORDER BY name DESC

medium pred: SELECT
medium gold: SELECT name ,  date FROM battle

medium pred: SELECT
medium gold: SELECT max(killed) ,  min(killed) FROM death

easy pred: SELECT
easy gold: SELECT avg(injured) FROM death

hard pred: SELECT
hard gold: SELECT T1.id ,  T1.name FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle JOIN death AS T3 ON T2.id  =  T3.caused_by_ship_id GROUP BY T1.id HAVING sum(T3.killed)  >  10

extra pred: SELECT
extra gold: SELECT T2.id ,  T2.name FROM death AS T1 JOIN ship AS t2 ON T1.caused_by_ship_id  =  T2.id GROUP BY T2.id ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT
easy gold: SELECT count(DISTINCT RESULT) FROM battle

extra pred: SELECT
extra gold: SELECT count(*) FROM battle WHERE id NOT IN ( SELECT lost_in_battle FROM ship WHERE tonnage  =  '225' );

extra pred: SELECT
extra gold: SELECT T1.name ,  T1.date FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle WHERE T2.name  =  'Lettice' INTERSECT SELECT T1.name ,  T1.date FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle WHERE T2.name  =  'HMS Atalanta'

medium pred: SELECT
medium gold: SELECT line_1 ,  line_2 FROM addresses

easy pred: SELECT
easy gold: SELECT count(*) FROM Courses

easy pred: SELECT
easy gold: SELECT course_description FROM Courses WHERE course_name  =  'math'

easy pred: SELECT
easy gold: SELECT zip_postcode FROM Addresses WHERE city  =  'Port Chelsea'

extra pred: SELECT
extra gold: SELECT T2.department_name ,  T1.department_id FROM Degree_Programs AS T1 JOIN Departments AS T2 ON T1.department_id  =  T2.department_id GROUP BY T1.department_id ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT
extra gold: select t2.department_name ,  t1.department_id from degree_programs as t1 join departments as t2 on t1.department_id  =  t2.department_id group by t1.department_id order by count(*) desc limit 1

medium pred: SELECT
medium gold: SELECT count(*) FROM Departments AS T1 JOIN Degree_Programs AS T2 ON T1.department_id  =  T2.department_id WHERE T1.department_name  =  'engineer'

medium pred: SELECT
medium gold: SELECT section_name ,  section_description FROM Sections

extra pred: SELECT
extra gold: SELECT T1.semester_name ,  T1.semester_id FROM Semesters AS T1 JOIN Student_Enrolment AS T2 ON T1.semester_id  =  T2.semester_id GROUP BY T1.semester_id ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT
hard gold: SELECT DISTINCT T1.first_name ,  T1.middle_name ,  T1.last_name FROM Students AS T1 JOIN Student_Enrolment AS T2 ON T1.student_id  =  T2.student_id JOIN Degree_Programs AS T3 ON T2.degree_program_id  =  T3.degree_program_id WHERE T3.degree_summary_name  =  'Bachelor'

hard pred: SELECT
hard gold: SELECT semester_name FROM Semesters WHERE semester_id NOT IN( SELECT semester_id FROM Student_Enrolment )

hard pred: SELECT
hard gold: SELECT count(*) ,  student_course_id FROM Transcript_Contents GROUP BY student_course_id ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT
easy gold: SELECT Title FROM Cartoon ORDER BY title

easy pred: SELECT
easy gold: SELECT Title FROM Cartoon WHERE Directed_by = "Ben Jones";

easy pred: SELECT
easy gold: SELECT count(*) FROM Cartoon WHERE Written_by = "Joseph Kuhr";

medium pred: SELECT
medium gold: SELECT title ,  Directed_by FROM Cartoon ORDER BY Original_air_date

medium pred: SELECT
medium gold: SELECT Title FROM Cartoon WHERE Directed_by = "Ben Jones" OR Directed_by = "Brandon Vietti";

hard pred: SELECT
hard gold: SELECT Country ,  count(*) FROM TV_Channel GROUP BY Country ORDER BY count(*) DESC LIMIT 1;

medium pred: SELECT
medium gold: SELECT count(DISTINCT series_name) ,  count(DISTINCT content) FROM TV_Channel;

hard pred: SELECT
hard gold: SELECT LANGUAGE ,  count(*) FROM TV_Channel GROUP BY LANGUAGE ORDER BY count(*) ASC LIMIT 1;

hard pred: SELECT
hard gold: SELECT country FROM TV_Channel EXCEPT SELECT T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.written_by  =  'Todd Casey'

extra pred: SELECT
extra gold: SELECT T1.series_name ,  T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.directed_by  =  'Michael Chang' INTERSECT SELECT T1.series_name ,  T1.country FROM TV_Channel AS T1 JOIN cartoon AS T2 ON T1.id = T2.Channel WHERE T2.directed_by  =  'Ben Jones'

easy pred: SELECT
easy gold: SELECT count(*) FROM poker_player

easy pred: SELECT
easy gold: SELECT Earnings FROM poker_player ORDER BY Earnings DESC

medium pred: SELECT
medium gold: SELECT Final_Table_Made ,  Best_Finish FROM poker_player

easy pred: SELECT
easy gold: SELECT avg(Earnings) FROM poker_player

medium pred: SELECT
medium gold: SELECT Money_Rank FROM poker_player ORDER BY Earnings DESC LIMIT 1

medium pred: SELECT
medium gold: SELECT T1.Name FROM people AS T1 JOIN poker_player AS T2 ON T1.People_ID  =  T2.People_ID WHERE T2.Earnings  >  300000

hard pred: SELECT
hard gold: SELECT T1.Birth_Date FROM people AS T1 JOIN poker_player AS T2 ON T1.People_ID  =  T2.People_ID ORDER BY T2.Earnings ASC LIMIT 1

hard pred: SELECT
hard gold: SELECT T2.Money_Rank FROM people AS T1 JOIN poker_player AS T2 ON T1.People_ID  =  T2.People_ID ORDER BY T1.Height DESC LIMIT 1

hard pred: SELECT
hard gold: SELECT Nationality FROM people GROUP BY Nationality ORDER BY COUNT(*) DESC LIMIT 1

easy pred: SELECT
easy gold: SELECT count(*) FROM area_code_state

medium pred: SELECT
medium gold: SELECT contestant_number ,  contestant_name FROM contestants ORDER BY contestant_name DESC

medium pred: SELECT
medium gold: SELECT vote_id ,  phone_number ,  state FROM votes

medium pred: SELECT
medium gold: SELECT max(area_code) ,  min(area_code) FROM area_code_state

easy pred: SELECT
easy gold: SELECT max(created) FROM votes WHERE state  =  'CA'

easy pred: SELECT
easy gold: SELECT contestant_name FROM contestants WHERE contestant_name != 'Jessie Alloway'

extra pred: SELECT

In [92]:
llama_7b_complex_scores = await evaluate(gold_path, llama_7b_complex_pred_path, db_dir, etype, kmaps, plug_value, keep_distinct, progress_bar_for_each_datapoint)

medium pred: SELECT name, country, age FROM singer WHERE age = (SELECT MIN(age)
medium gold: SELECT name ,  country ,  age FROM singer ORDER BY age DESC

medium pred: SELECT average(age), MIN(age), MAX(age) FROM singer WHERE country =
medium gold: SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'

medium pred: SELECT Name, Song_release_year FROM singer WHERE Age < (SELECT MIN(Age
medium gold: SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1

easy pred: SELECT "Country" FROM "singer" WHERE "Age" > 20
easy gold: SELECT DISTINCT country FROM singer WHERE age  >  20

hard pred: SELECT "Name" FROM "singer_in_concert" WHERE "Singer
hard gold: SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)

extra pred: SELECT name, capacity FROM stadium WHERE year > 2014
extra gold: SELECT T2.name ,  T2.capacity FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  >=  2014 GROUP BY T2.stadium_id ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT name, capacity FROM stadium WHERE year > 2013
extra gold: select t2.name ,  t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id  =  t2.stadium_id where t1.year  >  2013 group by t2.stadium_id order by count(*) desc limit 1

hard pred: SELECT     year(concerts.Year) as year,
hard gold: SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT "Name" FROM "stadium" WHERE "Stadium_ID" NOT
hard gold: SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)

extra pred: SELECT name, location FROM stadium WHERE exists (SELECT 1 FROM concert WHERE year =
extra gold: SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015

easy pred: SELECT COUNT(*) FROM Has_Pet WHERE weight > 10
easy gold: SELECT count(*) FROM pets WHERE weight  >  10

medium pred: SELECT weight FROM Pets WHERE Major = 1
medium gold: SELECT weight FROM pets ORDER BY pet_age LIMIT 1

medium pred: SELECT PetType, MAX(weight)  FROM Pets  GROUP BY Pet
medium gold: SELECT max(weight) ,  petType FROM pets GROUP BY petType

medium pred: SELECT COUNT(*) FROM Has_Pet WHERE Student.Age > 20
medium gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20

hard pred: SELECT COUNT(*) FROM Has_Pet WHERE Sex = 'F' AND PetType =
hard gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'

easy pred: SELECT DISTINCT PetType FROM Has_Pet
easy gold: SELECT count(DISTINCT pettype) FROM pets

extra pred: SELECT Fname FROM Student WHERE Major = 1 AND (SELECT COUNT(*) FROM Has_
extra gold: SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'

extra pred: SELECT Fname FROM Student WHERE Has_Pet.StuID = Student.St
extra gold: select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat' intersect select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'dog'

extra pred: SELECT Fname FROM Student WHERE Has_Pet.StuID IN (SELECT
extra gold: SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog'

hard pred: SELECT StuID FROM Has_Pet WHERE PetType = 'cat'
hard gold: SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'

hard pred: SELECT LName FROM Student WHERE Major = 1 AND Age = 3 AND Sex =
hard gold: SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'

medium pred: SELECT continents.ContId, continents.Continent, COUNT(*) as num
medium gold: SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;

medium pred: SELECT maker, COUNT(*) as num_models FROM car_makers
medium gold: SELECT T1.FullName ,  T1.Id ,  count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id;

hard pred: SELECT * FROM cars_data WHERE Horsepower = (SELECT MIN(Horse
hard gold: SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1;

extra pred: SELECT       "Model"  FROM       "car_names"
extra gold: SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.Weight  <  (SELECT avg(Weight) FROM CARS_DATA)

extra pred: SELECT maker FROM car_names WHERE year = 1970
extra gold: SELECT DISTINCT T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker JOIN CAR_NAMES AS T3 ON T2.model  =  T3.model JOIN CARS_DATA AS T4 ON T3.MakeId  =  T4.id WHERE T4.year  =  '1970';

extra pred: SELECT    car_names.Make,    cars_
extra gold: SELECT T2.Make ,  T1.Year FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T1.Year  =  (SELECT min(YEAR) FROM CARS_DATA);

hard pred: SELECT distinct(Model) FROM "car_names" WHERE "Year" > 1
hard gold: SELECT DISTINCT T1.model FROM MODEL_LIST AS T1 JOIN CAR_NAMES AS T2 ON T1.model  =  T2.model JOIN CARS_DATA AS T3 ON T2.MakeId  =  T3.id WHERE T3.year  >  1980;

hard pred: SELECT continent, COUNT(*) as num_car_makers FROM car_m
hard gold: SELECT T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.continent JOIN car_makers AS T3 ON T2.CountryId  =  T3.Country GROUP BY T1.Continent;

medium pred: SELECT maker, COUNT(*) as count FROM car_names JOIN car
medium gold: select count(*) ,  t2.fullname from model_list as t1 join car_makers as t2 on t1.maker  =  t2.id group by t2.id;

easy pred: SELECT mpg FROM cars_data WHERE Cylinders = 4
easy gold: SELECT avg(mpg) FROM CARS_DATA WHERE Cylinders  =  4;

easy pred: SELECT Country FROM flights WHERE Airline = 'JetBlue Airways'
easy gold: SELECT Country FROM AIRLINES WHERE Airline  =  "JetBlue Airways"

easy pred: SELECT Abbreviation FROM airlines WHERE Airline = 'JetBlue Airways
easy gold: SELECT Abbreviation FROM AIRLINES WHERE Airline  =  "JetBlue Airways"

medium pred: SELECT AirportName, Country FROM airports WHERE AirportCode = 'AEX'
medium gold: SELECT City ,  Country FROM AIRPORTS WHERE AirportName  =  "Alton"

hard pred: SELECT COUNT(*) FROM flights WHERE SourceAirport = 'Aberde
hard gold: SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport  =  T3.AirportCode WHERE T2.City  =  "Ashley" AND T3.City  =  "Aberdeen"

hard pred: SELECT COUNT(*) FROM flights WHERE Airline = 'United Airlines'
hard gold: SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode JOIN AIRLINES AS T3 ON T3.uid  =  T1.Airline WHERE T2.City  =  "Aberdeen" AND T3.Airline  =  "United Airlines"

extra pred: SELECT City, COUNT(*) as num_flights FROM flights GROUP
extra gold: SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport GROUP BY T1.City ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT City, COUNT(*) as num_departing_flights FROM air
extra gold: SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.SourceAirport GROUP BY T1.City ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT airports.AirportName, COUNT(*) as num_flights
extra gold: SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport OR T1.AirportCode  =  T2.SourceAirport GROUP BY T1.AirportCode ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT COUNT(*) FROM flights WHERE SourceAirport = 'ABZ' OR Dest
hard gold: SELECT count(*) FROM Flights AS T1 JOIN Airports AS T2 ON T1.DestAirport  =  T2.AirportCode WHERE T2.city  =  "Aberdeen" OR T2.city  =  "Abilene"

easy pred: SELECT * FROM employee WHERE Age > (SELECT AVG(Age) FROM employee)
easy gold: SELECT name FROM employee ORDER BY age

medium pred: SELECT City, COUNT(*) as num_employees FROM hiring
medium gold: SELECT count(*) ,  city FROM employee GROUP BY city

medium pred: SELECT City FROM employee WHERE Age < 30
medium gold: SELECT city FROM employee WHERE age  <  30 GROUP BY city HAVING count(*)  >  1

medium pred: SELECT Location, COUNT(*) as num_shops   FROM shop   GROUP BY
medium gold: SELECT count(*) ,  LOCATION FROM shop GROUP BY LOCATION

hard pred: SELECT * FROM shop WHERE number_products > (SELECT AVG(number_products)
hard gold: SELECT name FROM shop WHERE number_products  >  (SELECT avg(number_products) FROM shop)

extra pred: SELECT name FROM evaluation WHERE year_awarded = (SELECT MAX(year_a
extra gold: SELECT t1.name FROM employee AS t1 JOIN evaluation AS t2 ON t1.Employee_ID  =  t2.Employee_ID GROUP BY t2.Employee_ID ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT name FROM employee WHERE bonus > (SELECT MAX(bonus) FROM evaluation)
hard gold: SELECT t1.name FROM employee AS t1 JOIN evaluation AS t2 ON t1.Employee_ID  =  t2.Employee_ID ORDER BY t2.bonus DESC LIMIT 1

hard pred: SELECT Employee_ID FROM hiring WHERE Is_full_time = 0
hard gold: SELECT name FROM employee WHERE Employee_ID NOT IN (SELECT Employee_ID FROM evaluation)

extra pred: SELECT Shop_ID, COUNT(*) as num_employees  FROM hiring
extra gold: SELECT t2.name FROM hiring AS t1 JOIN shop AS t2 ON t1.shop_id  =  t2.shop_id GROUP BY t1.shop_id ORDER BY count(*) DESC LIMIT 1

medium pred: SELECT Documents.Document_ID, Documents.Document_Name, Documents.
medium gold: SELECT document_id ,  document_name ,  document_description FROM Documents

medium pred: SELECT Document_Name, Template_ID FROM Documents WHERE Document_Description
medium gold: SELECT document_name ,  template_id FROM Documents WHERE Document_Description LIKE "%w%"

medium pred: SELECT Document_ID, Template_ID, Template_Description FROM Documents
medium gold: SELECT document_id ,  template_id ,  Document_Description FROM Documents WHERE document_name  =  "Robbin CV"

easy pred: SELECT COUNT(*) FROM Documents WHERE Template_ID IS NOT NULL
easy gold: SELECT count(DISTINCT template_id) FROM Documents

extra pred: SELECT Template_Type_Code, COUNT(*) as num_docs FROM Documents
extra gold: SELECT T1.template_id ,  T2.Template_Type_Code FROM Documents AS T1 JOIN Templates AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_id ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT Template_ID FROM Templates WHERE EXISTS (SELECT 1 FROM Documents WHERE Template
easy gold: SELECT template_id FROM Documents GROUP BY template_id HAVING count(*)  >  1

hard pred: SELECT Template_ID FROM Templates WHERE NOT EXISTS (SELECT 1 FROM Documents WHERE
hard gold: SELECT template_id FROM Templates EXCEPT SELECT template_id FROM Documents

hard pred: SELECT Template_Type_Code, COUNT(*) as num_templates FROM Tem
hard gold: SELECT template_type_code FROM Templates GROUP BY template_type_code ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT Template_Type_Code, COUNT(*) as num_of_documents
extra gold: SELECT T1.template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_type_code ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT Template_Type_Code FROM Ref_Template_Types WHERE NOT EXISTS (SELECT
hard gold: SELECT template_type_code FROM Templates EXCEPT SELECT template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id

extra pred: SELECT Document_ID, Document_Name, COUNT(*) as Num_Paragraphs
extra gold: SELECT T1.document_id ,  T2.document_name FROM Paragraphs AS T1 JOIN Documents AS T2 ON T1.document_id  =  T2.document_id GROUP BY T1.document_id ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT "Teacher".* FROM "course_arrange" JOIN "teacher"
easy gold: SELECT Name FROM teacher ORDER BY Age ASC

medium pred: SELECT "Teacher".* FROM "course_arrange" JOIN "teacher"
medium gold: SELECT Age ,  Hometown FROM teacher

easy pred: SELECT name FROM teacher WHERE hometown NOT LIKE '%Little Lever Urban District
easy gold: select name from teacher where hometown != "little lever urban district"

medium pred: SELECT "Teacher".* FROM "course_arrange" JOIN "teacher"
medium gold: SELECT Name FROM teacher WHERE Age  =  32 OR Age  =  33

medium pred: SELECT hometown FROM teacher WHERE age = (SELECT MIN(age) FROM teacher)
medium gold: SELECT Hometown FROM teacher ORDER BY Age ASC LIMIT 1

hard pred: SELECT hometown FROM teacher WHERE grade = (SELECT MAX(grade) FROM course_
hard gold: SELECT Hometown FROM teacher GROUP BY Hometown ORDER BY COUNT(*) DESC LIMIT 1

hard pred: SELECT "Teacher".* FROM "course_arrange" JOIN "teacher"
hard gold: SELECT T3.Name ,  T2.Course FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID ORDER BY T3.Name

hard pred: SELECT name FROM teacher WHERE course_id = (SELECT course_id FROM course_ar
hard gold: SELECT T3.Name FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID WHERE T2.Course  =  "Math"

medium pred: SELECT visitor.Name,         (SELECT level_of_membership
medium gold: SELECT name FROM visitor WHERE Level_of_membership  >  4 ORDER BY Level_of_membership DESC

easy pred: SELECT AVG(Age) FROM visitor WHERE Level_of_membership < 4
easy gold: SELECT avg(age) FROM visitor WHERE Level_of_membership  <=  4

medium pred: SELECT v.Name, v.Level_of_membership FROM visitor
medium gold: SELECT name ,  Level_of_membership FROM visitor WHERE Level_of_membership  >  4 ORDER BY age DESC

medium pred: SELECT Museum_ID, Name FROM museum GROUP BY Museum_ID ORDER
medium gold: SELECT museum_id ,  name FROM museum ORDER BY num_of_staff DESC LIMIT 1

easy pred: SELECT      AVG(Num_of_Staff) FROM
easy gold: SELECT avg(num_of_staff) FROM museum WHERE open_year  <  2009

hard pred: SELECT name FROM museum WHERE open_year > '2010' AND staff
hard gold: SELECT name FROM museum WHERE num_of_staff  >  (SELECT min(num_of_staff) FROM museum WHERE open_year  >  2010)

extra pred: SELECT visitor.Name, visitor.Level_of_membership FROM visitor
extra gold: SELECT t2.visitor_id ,  t1.name ,  t1.Level_of_membership FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id GROUP BY t2.visitor_id ORDER BY sum(t2.Total_spent) DESC LIMIT 1

extra pred: SELECT name, COUNT(*) as num_visits FROM visit GROUP BY name
extra gold: SELECT t2.Museum_ID ,  t1.name FROM museum AS t1 JOIN visit AS t2 ON t1.Museum_ID  =  t2.Museum_ID GROUP BY t2.Museum_ID ORDER BY count(*) DESC LIMIT 1

hard pred: select * from museum where num_of_staff = 0
hard gold: SELECT name FROM museum WHERE Museum_ID NOT IN (SELECT museum_id FROM visit)

hard pred: SELECT name, age FROM visitor WHERE num_of_ticket = (SELECT MAX(num
hard gold: SELECT t1.name ,  t1.age FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id ORDER BY t2.num_of_ticket DESC LIMIT 1

extra pred: SELECT visitor.Name FROM visitor JOIN visit ON visitor.ID = visit
extra gold: SELECT t1.name FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id JOIN museum AS t3 ON t3.Museum_ID  =  t2.Museum_ID WHERE t3.open_year  <  2009 INTERSECT SELECT t1.name FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id JOIN museum AS t3 ON t3.Museum_ID  =  t2.Museum_ID WHERE t3.open_year  >  2011

easy pred: SELECT
easy gold: SELECT count(*) FROM players

easy pred: SELECT
easy gold: SELECT count(*) FROM matches

medium pred: SELECT
medium gold: SELECT first_name ,  birth_date FROM players WHERE country_code  =  'USA'

medium pred: SELECT
medium gold: SELECT avg(loser_age) ,  avg(winner_age) FROM matches

easy pred: SELECT
easy gold: SELECT avg(winner_rank) FROM matches

hard pred: SELECT
hard gold: SELECT winner_name FROM matches WHERE YEAR  =  2013 INTERSECT SELECT winner_name FROM matches WHERE YEAR  =  2016

medium pred: SELECT
medium gold: SELECT count(*) FROM matches WHERE YEAR  =  2013 OR YEAR  =  2016

extra pred: SELECT
extra gold: SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN matches AS T2 ON T1.player_id  =  T2.winner_id WHERE T2.tourney_name  =  'WTA Championships' INTERSECT SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN matches AS T2 ON T1.player_id  =  T2.winner_id WHERE T2.tourney_name  =  'Australian Open'

hard pred: SELECT
hard gold: SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN rankings AS T2 ON T1.player_id  =  T2.player_id ORDER BY T2.tours DESC LIMIT 1

hard pred: SELECT
hard gold: SELECT YEAR FROM matches GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT    COUNT(*)  FROM    ship  WHERE
easy gold: SELECT count(*) FROM ship WHERE disposition_of_ship  =  'Captured'

medium pred: SELECT name, date, result FROM battle
medium gold: SELECT name ,  date FROM battle

medium pred: SELECT      MIN(death.killed),      MAX
medium gold: SELECT max(killed) ,  min(killed) FROM death

hard pred: SELECT id, name, COUNT(*) as num_killed FROM battle J
hard gold: SELECT T1.id ,  T1.name FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle JOIN death AS T3 ON T2.id  =  T3.caused_by_ship_id GROUP BY T1.id HAVING sum(T3.killed)  >  10

extra pred: SELECT ship.name, SUM(injured) AS total_injuries
extra gold: SELECT T2.id ,  T2.name FROM death AS T1 JOIN ship AS t2 ON T1.caused_by_ship_id  =  T2.id GROUP BY T2.id ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT * FROM battle
easy gold: SELECT count(DISTINCT RESULT) FROM battle

extra pred: SELECT * FROM battle WHERE lost_in_battle = 0 AND tonn
extra gold: SELECT count(*) FROM battle WHERE id NOT IN ( SELECT lost_in_battle FROM ship WHERE tonnage  =  '225' );

extra pred: SELECT name, date FROM battle WHERE lost_in_battle = (
extra gold: SELECT T1.name ,  T1.date FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle WHERE T2.name  =  'Lettice' INTERSECT SELECT T1.name ,  T1.date FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle WHERE T2.name  =  'HMS Atalanta'

medium pred: SELECT
medium gold: SELECT line_1 ,  line_2 FROM addresses

easy pred: SELECT
easy gold: SELECT count(*) FROM Courses

easy pred: SELECT
easy gold: SELECT course_description FROM Courses WHERE course_name  =  'math'

easy pred: SELECT
easy gold: SELECT zip_postcode FROM Addresses WHERE city  =  'Port Chelsea'

extra pred: SELECT
extra gold: SELECT T2.department_name ,  T1.department_id FROM Degree_Programs AS T1 JOIN Departments AS T2 ON T1.department_id  =  T2.department_id GROUP BY T1.department_id ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT
extra gold: select t2.department_name ,  t1.department_id from degree_programs as t1 join departments as t2 on t1.department_id  =  t2.department_id group by t1.department_id order by count(*) desc limit 1

medium pred: SELECT
medium gold: SELECT count(*) FROM Departments AS T1 JOIN Degree_Programs AS T2 ON T1.department_id  =  T2.department_id WHERE T1.department_name  =  'engineer'

medium pred: SELECT
medium gold: SELECT section_name ,  section_description FROM Sections

extra pred: SELECT
extra gold: SELECT T1.semester_name ,  T1.semester_id FROM Semesters AS T1 JOIN Student_Enrolment AS T2 ON T1.semester_id  =  T2.semester_id GROUP BY T1.semester_id ORDER BY count(*) DESC LIMIT 1


In [93]:
defog_sqlcoder_7b_scores = await evaluate(gold_path, defog_sqlcoder_7b_pred_path, db_dir, etype, kmaps, plug_value, keep_distinct, progress_bar_for_each_datapoint)

medium pred: SELECT singer.name, singer.country, singer.age FROM singer ORDER BY singer
medium gold: SELECT name ,  country ,  age FROM singer ORDER BY age DESC

medium pred: SELECT AVG(singer.age) AS average_age, MIN(singer.
medium gold: SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'

medium pred: SELECT s.name, to_number(s.song_release_year,
medium gold: SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1

easy pred: SELECT s.country FROM singer s JOIN singer_in_concert sic ON s
easy gold: SELECT DISTINCT country FROM singer WHERE age  >  20

hard pred: SELECT s.song_name FROM singer s JOIN singer_in_concert
hard gold: SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)

extra pred: SELECT s.name, s.capacity FROM stadium s JOIN concert c ON s.
extra gold: SELECT T2.name ,  T2.capacity FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  >=  2014 GROUP BY T2.stadium_id ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT s.name, s.capacity FROM stadium s JOIN concert c ON s
extra gold: select t2.name ,  t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id  =  t2.stadium_id where t1.year  >  2013 group by t2.stadium_id order by count(*) desc limit 1

hard pred: SELECT MAX(Year) AS max_year FROM concert
hard gold: SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT stadium.name FROM stadium LEFT JOIN concert ON stadium.stadium_id =
hard gold: SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)

extra pred: SELECT s.name, s.location FROM stadium s JOIN concert c ON s.
extra gold: SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015

easy pred: SELECT COUNT(PetID) FROM Pets WHERE weight > 10
easy gold: SELECT count(*) FROM pets WHERE weight  >  10

medium pred: SELECT MIN(pets.weight) AS min_weight FROM has_pet
medium gold: SELECT weight FROM pets ORDER BY pet_age LIMIT 1

medium pred: SELECT PetType FROM Pets GROUP BY Pet
medium gold: SELECT max(weight) ,  petType FROM pets GROUP BY petType

medium pred: SELECT COUNT(*) FROM Student s JOIN Has_Pet hp ON
medium gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20

hard pred: SELECT COUNT(*) FROM Student s JOIN Has_Pet hp ON
hard gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'

easy pred: SELECT COUNT(DISTINCT PetType) AS pet_types FROM
easy gold: SELECT count(DISTINCT pettype) FROM pets

extra pred: SELECT
extra gold: SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'

extra pred: SELECT Student.Fname FROM Student JOIN Has_Pet ON Student.StuID =
extra gold: select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat' intersect select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'dog'

extra pred: SELECT Student.Fname FROM Student JOIN Has_Pet ON Student.St
extra gold: SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog'

hard pred: SELECT Student.StuID FROM Student LEFT JOIN Has_Pet ON
hard gold: SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'

hard pred: SELECT Student.LName FROM Student JOIN Has_Pet ON Student.St
hard gold: SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'

easy pred: SELECT
easy gold: SELECT count(*) FROM CONTINENTS;

medium pred: SELECT c.contid, c.continent, COUNT(cc.country
medium gold: SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;

easy pred: SELECT
easy gold: SELECT count(*) FROM COUNTRIES;

medium pred: SELECT
medium gold: SELECT T1.FullName ,  T1.Id ,  count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id;

hard pred: SELECT model_list.model FROM model_list JOIN car_
hard gold: SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1;

extra pred: SELECT model_list.model FROM model_list JOIN cars_data ON model_
extra gold: SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.Weight  <  (SELECT avg(Weight) FROM CARS_DATA)

extra pred: SELECT car_makers.maker FROM car_makers JOIN cars_data ON car
extra gold: SELECT DISTINCT T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker JOIN CAR_NAMES AS T3 ON T2.model  =  T3.model JOIN CARS_DATA AS T4 ON T3.MakeId  =  T4.id WHERE T4.year  =  '1970';

extra pred: SELECT
extra gold: SELECT T2.Make ,  T1.Year FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T1.Year  =  (SELECT min(YEAR) FROM CARS_DATA);

hard pred: SELECT DISTINCT c.year, m.make FROM cars_data c
hard gold: SELECT DISTINCT T1.model FROM MODEL_LIST AS T1 JOIN CAR_NAMES AS T2 ON T1.model  =  T2.model JOIN CARS_DATA AS T3 ON T2.MakeId  =  T3.id WHERE T3.year  >  1980;

hard pred: SELECT c.continent, COUNT(cm.maker) AS maker_count
hard gold: SELECT T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.continent JOIN car_makers AS T3 ON T2.CountryId  =  T3.Country GROUP BY T1.Continent;

medium pred: SELECT car_makers.full_name, COUNT(model_list.model_id
medium gold: select count(*) ,  t2.fullname from model_list as t1 join car_makers as t2 on t1.maker  =  t2.id group by t2.id;

easy pred: SELECT AVG(cars_data.mpg) FROM cars
easy gold: SELECT avg(mpg) FROM CARS_DATA WHERE Cylinders  =  4;

easy pred: SELECT
easy gold: SELECT Country FROM AIRLINES WHERE Airline  =  "JetBlue Airways"

easy pred: SELECT abbreviation FROM airlines WHERE "airline" ILIKE '%jetblue
easy gold: SELECT Abbreviation FROM AIRLINES WHERE Airline  =  "JetBlue Airways"

medium pred: SELECT airlines.airline, airlines.abbreviation
medium gold: SELECT Airline ,  Abbreviation FROM AIRLINES WHERE Country  =  "USA"

medium pred: SELECT a.AirportCode, a.AirportName FROM air
medium gold: SELECT AirportCode ,  AirportName FROM AIRPORTS WHERE city  =  "Anthony"

easy pred: SELECT
easy gold: SELECT count(*) FROM AIRLINES

medium pred: SELECT
medium gold: SELECT City ,  Country FROM AIRPORTS WHERE AirportName  =  "Alton"

hard pred: SELECT
hard gold: SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport  =  T3.AirportCode WHERE T2.City  =  "Ashley" AND T3.City  =  "Aberdeen"

hard pred: SELECT COUNT(*) FROM flights f JOIN airports a ON
hard gold: SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode JOIN AIRLINES AS T3 ON T3.uid  =  T1.Airline WHERE T2.City  =  "Aberdeen" AND T3.Airline  =  "United Airlines"

extra pred: SELECT
extra gold: SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport GROUP BY T1.City ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT
extra gold: SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.SourceAirport GROUP BY T1.City ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT
extra gold: SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport OR T1.AirportCode  =  T2.SourceAirport GROUP BY T1.AirportCode ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT COUNT(*) AS number_of_flights FROM flights WHERE (SourceAir
hard gold: SELECT count(*) FROM Flights AS T1 JOIN Airports AS T2 ON T1.DestAirport  =  T2.AirportCode WHERE T2.city  =  "Aberdeen" OR T2.city  =  "Abilene"

easy pred: SELECT
easy gold: SELECT count(*) FROM employee

easy pred: SELECT e.name, e.age FROM employee e ORDER BY e.age A
easy gold: SELECT name FROM employee ORDER BY age

medium pred: SELECT city, COUNT(*) AS number_of_employees FROM employee GRO
medium gold: SELECT count(*) ,  city FROM employee GROUP BY city

medium pred: SELECT DISTINCT h.shop.location FROM h.shop JOIN h.h
medium gold: SELECT city FROM employee WHERE age  <  30 GROUP BY city HAVING count(*)  >  1

medium pred: SELECT s.location, COUNT(*) AS number_of_shops FROM shop s
medium gold: SELECT count(*) ,  LOCATION FROM shop GROUP BY LOCATION

hard pred: SELECT shop.name FROM shop WHERE shop.number_products > (SELECT AVG(
hard gold: SELECT name FROM shop WHERE number_products  >  (SELECT avg(number_products) FROM shop)

extra pred: SELECT
extra gold: SELECT t1.name FROM employee AS t1 JOIN evaluation AS t2 ON t1.Employee_ID  =  t2.Employee_ID GROUP BY t2.Employee_ID ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT
hard gold: SELECT t1.name FROM employee AS t1 JOIN evaluation AS t2 ON t1.Employee_ID  =  t2.Employee_ID ORDER BY t2.bonus DESC LIMIT 1

hard pred: SELECT e.name FROM employee e LEFT JOIN evaluation a ON e.employee
hard gold: SELECT name FROM employee WHERE Employee_ID NOT IN (SELECT Employee_ID FROM evaluation)

extra pred: SELECT shop.name, COUNT(hiring.employee_id)
extra gold: SELECT t2.name FROM hiring AS t1 JOIN shop AS t2 ON t1.shop_id  =  t2.shop_id GROUP BY t1.shop_id ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT
easy gold: SELECT sum(bonus) FROM evaluation

easy pred: SELECT COUNT(Document_ID) AS total_documents FROM
easy gold: SELECT count(*) FROM Documents

medium pred: SELECT d.document_id, d.document_name, d
medium gold: SELECT document_id ,  document_name ,  document_description FROM Documents

medium pred: SELECT
medium gold: SELECT document_name ,  template_id FROM Documents WHERE Document_Description LIKE "%w%"

medium pred: SELECT
medium gold: SELECT document_id ,  template_id ,  Document_Description FROM Documents WHERE document_name  =  "Robbin CV"

easy pred: SELECT COUNT(DISTINCT templates.template_type_code)
easy gold: SELECT count(DISTINCT template_id) FROM Documents

extra pred: SELECT templates.template_id, templates.template_type_code FROM templates
extra gold: SELECT T1.template_id ,  T2.Template_Type_Code FROM Documents AS T1 JOIN Templates AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_id ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT
easy gold: SELECT template_id FROM Documents GROUP BY template_id HAVING count(*)  >  1

hard pred: SELECT t.template_id FROM templates t LEFT JOIN documents d ON t
hard gold: SELECT template_id FROM Templates EXCEPT SELECT template_id FROM Documents

hard pred: SELECT Ref_Template_Types.template_type_code, COUNT(
hard gold: SELECT template_type_code FROM Templates GROUP BY template_type_code ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT Ref_Template_Types.Template_Type_Code, COUNT(
extra gold: SELECT T1.template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_type_code ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT Ref_Template_Types.Template_Type_Code FROM Ref
hard gold: SELECT template_type_code FROM Templates EXCEPT SELECT template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id

extra pred: SELECT Documents.Document_ID, Documents.Document_Name FROM Doc
extra gold: SELECT T1.document_id ,  T2.document_name FROM Paragraphs AS T1 JOIN Documents AS T2 ON T1.document_id  =  T2.document_id GROUP BY T1.document_id ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT
easy gold: SELECT count(*) FROM teacher

easy pred: SELECT
easy gold: SELECT Name FROM teacher ORDER BY Age ASC

easy pred: SELECT teacher.name FROM teacher WHERE teacher.homeown not ilike '% Little Lever Urban
easy gold: select name from teacher where hometown != "little lever urban district"

medium pred: SELECT
medium gold: SELECT Name FROM teacher WHERE Age  =  32 OR Age  =  33

medium pred: SELECT teacher.name, MIN(teacher.age) AS min_age
medium gold: SELECT Hometown FROM teacher ORDER BY Age ASC LIMIT 1

hard pred: SELECT
hard gold: SELECT Hometown FROM teacher GROUP BY Hometown ORDER BY COUNT(*) DESC LIMIT 1

hard pred: SELECT
hard gold: SELECT T3.Name ,  T2.Course FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID ORDER BY T3.Name

hard pred: SELECT
hard gold: SELECT T3.Name FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID WHERE T2.Course  =  "Math"

medium pred: SELECT v.name, m.name, v.level_of_membership FROM
medium gold: SELECT name FROM visitor WHERE Level_of_membership  >  4 ORDER BY Level_of_membership DESC

easy pred: SELECT AVG(v.age) AS average_age FROM visitor
easy gold: SELECT avg(age) FROM visitor WHERE Level_of_membership  <=  4

medium pred: SELECT v.name, m.name, v.age FROM visitor v JOIN museum
medium gold: SELECT name ,  Level_of_membership FROM visitor WHERE Level_of_membership  >  4 ORDER BY age DESC

medium pred: SELECT
medium gold: SELECT museum_id ,  name FROM museum ORDER BY num_of_staff DESC LIMIT 1

easy pred: SELECT
easy gold: SELECT avg(num_of_staff) FROM museum WHERE open_year  <  2009

hard pred: SELECT
hard gold: SELECT name FROM museum WHERE num_of_staff  >  (SELECT min(num_of_staff) FROM museum WHERE open_year  >  2010)

extra pred: SELECT
extra gold: SELECT t2.visitor_id ,  t1.name ,  t1.Level_of_membership FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id GROUP BY t2.visitor_id ORDER BY sum(t2.Total_spent) DESC LIMIT 1

extra pred: SELECT
extra gold: SELECT t2.Museum_ID ,  t1.name FROM museum AS t1 JOIN visit AS t2 ON t1.Museum_ID  =  t2.Museum_ID GROUP BY t2.Museum_ID ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT "Name" FROM "museum" WHERE "Museum_
hard gold: SELECT name FROM museum WHERE Museum_ID NOT IN (SELECT museum_id FROM visit)

hard pred: SELECT
hard gold: SELECT t1.name ,  t1.age FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id ORDER BY t2.num_of_ticket DESC LIMIT 1

extra pred: SELECT
extra gold: SELECT t1.name FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id JOIN museum AS t3 ON t3.Museum_ID  =  t2.Museum_ID WHERE t3.open_year  <  2009 INTERSECT SELECT t1.name FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id JOIN museum AS t3 ON t3.Museum_ID  =  t2.Museum_ID WHERE t3.open_year  >  2011

easy pred: SELECT
easy gold: SELECT count(*) FROM players

easy pred: SELECT COUNT(*) AS total_matches FROM matches
easy gold: SELECT count(*) FROM matches

medium pred: SELECT players.player_first_name, players.player_last_name, players.
medium gold: SELECT first_name ,  birth_date FROM players WHERE country_code  =  'USA'

medium pred: SELECT (SUM(CASE WHEN players.player_id IN (SELECT loser
medium gold: SELECT avg(loser_age) ,  avg(winner_age) FROM matches

easy pred: SELECT AVG(winner_rank) AS average_winner_rank FROM matches
easy gold: SELECT avg(winner_rank) FROM matches

hard pred: SELECT players.player_name FROM players WHERE players.player_id IN (SELECT winner_
hard gold: SELECT winner_name FROM matches WHERE YEAR  =  2013 INTERSECT SELECT winner_name FROM matches WHERE YEAR  =  2016

medium pred: SELECT COUNT(*) FROM matches WHERE year IN (2013, 2
medium gold: SELECT count(*) FROM matches WHERE YEAR  =  2013 OR YEAR  =  2016

extra pred: SELECT p.player_id, p.first_name, p.last_name,
extra gold: SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN matches AS T2 ON T1.player_id  =  T2.winner_id WHERE T2.tourney_name  =  'WTA Championships' INTERSECT SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN matches AS T2 ON T1.player_id  =  T2.winner_id WHERE T2.tourney_name  =  'Australian Open'

hard pred: SELECT players.player_first_name, players.player_country_code FROM players WHERE
hard gold: SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN rankings AS T2 ON T1.player_id  =  T2.player_id ORDER BY T2.tours DESC LIMIT 1

hard pred: SELECT COUNT(match_num), year FROM matches GROUP BY year ORDER
hard gold: SELECT YEAR FROM matches GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT COUNT(*) FROM ship WHERE name ilike '%Captured%'
easy gold: SELECT count(*) FROM ship WHERE disposition_of_ship  =  'Captured'

medium pred: SELECT
medium gold: SELECT name ,  tonnage FROM ship ORDER BY name DESC

medium pred: SELECT
medium gold: SELECT name ,  date FROM battle

medium pred: SELECT
medium gold: SELECT max(killed) ,  min(killed) FROM death

easy pred: SELECT
easy gold: SELECT avg(injured) FROM death

hard pred: SELECT
hard gold: SELECT T1.id ,  T1.name FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle JOIN death AS T3 ON T2.id  =  T3.caused_by_ship_id GROUP BY T1.id HAVING sum(T3.killed)  >  10

extra pred: SELECT
extra gold: SELECT T2.id ,  T2.name FROM death AS T1 JOIN ship AS t2 ON T1.caused_by_ship_id  =  T2.id GROUP BY T2.id ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT
easy gold: SELECT count(DISTINCT RESULT) FROM battle

extra pred: SELECT
extra gold: SELECT count(*) FROM battle WHERE id NOT IN ( SELECT lost_in_battle FROM ship WHERE tonnage  =  '225' );

extra pred: SELECT
extra gold: SELECT T1.name ,  T1.date FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle WHERE T2.name  =  'Lettice' INTERSECT SELECT T1.name ,  T1.date FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle WHERE T2.name  =  'HMS Atalanta'

medium pred: SELECT
medium gold: SELECT line_1 ,  line_2 FROM addresses

easy pred: SELECT
easy gold: SELECT count(*) FROM Courses

easy pred: SELECT
easy gold: SELECT course_description FROM Courses WHERE course_name  =  'math'

easy pred: SELECT
easy gold: SELECT zip_postcode FROM Addresses WHERE city  =  'Port Chelsea'

extra pred: SELECT
extra gold: SELECT T2.department_name ,  T1.department_id FROM Degree_Programs AS T1 JOIN Departments AS T2 ON T1.department_id  =  T2.department_id GROUP BY T1.department_id ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT
extra gold: select t2.department_name ,  t1.department_id from degree_programs as t1 join departments as t2 on t1.department_id  =  t2.department_id group by t1.department_id order by count(*) desc limit 1

medium pred: SELECT
medium gold: SELECT count(*) FROM Departments AS T1 JOIN Degree_Programs AS T2 ON T1.department_id  =  T2.department_id WHERE T1.department_name  =  'engineer'

medium pred: SELECT
medium gold: SELECT section_name ,  section_description FROM Sections

extra pred: SELECT
extra gold: SELECT T1.semester_name ,  T1.semester_id FROM Semesters AS T1 JOIN Student_Enrolment AS T2 ON T1.semester_id  =  T2.semester_id GROUP BY T1.semester_id ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT
hard gold: SELECT DISTINCT T1.first_name ,  T1.middle_name ,  T1.last_name FROM Students AS T1 JOIN Student_Enrolment AS T2 ON T1.student_id  =  T2.student_id JOIN Degree_Programs AS T3 ON T2.degree_program_id  =  T3.degree_program_id WHERE T3.degree_summary_name  =  'Bachelor'

hard pred: SELECT
hard gold: SELECT semester_name FROM Semesters WHERE semester_id NOT IN( SELECT semester_id FROM Student_Enrolment )

hard pred: SELECT

In [94]:
defog_sqlcoder_7b_complex_scores = await evaluate(gold_path, defog_sqlcoder_7b_complex_pred_path, db_dir, etype, kmaps, plug_value, keep_distinct, progress_bar_for_each_datapoint)

medium pred: SELECT singer.name, singer.country, singer.age FROM singer ORDER BY singer.
medium gold: SELECT name ,  country ,  age FROM singer ORDER BY age DESC

medium pred: SELECT AVG(singer.age), MIN(singer.age), MAX(s
medium gold: SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'

medium pred: SELECT s.name, to_number(s.song_release_year, '
medium gold: SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1

easy pred: SELECT s.name, to_number(s.age,'9999') AS
easy gold: SELECT DISTINCT country FROM singer WHERE age  >  20

hard pred: SELECT s.name, to_number(s.song_release_year, '
hard gold: SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)

extra pred: SELECT s.name, s.capacity FROM stadium s JOIN concert c ON s.stad
extra gold: SELECT T2.name ,  T2.capacity FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  >=  2014 GROUP BY T2.stadium_id ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT s.name, s.capacity FROM stadium s JOIN concert c ON s.stad
extra gold: select t2.name ,  t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id  =  t2.stadium_id where t1.year  >  2013 group by t2.stadium_id order by count(*) desc limit 1

hard pred: SELECT year, COUNT(concert_id) AS concert_count FROM concert GRO
hard gold: SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT "stadium"."Name" FROM "stadium" LEFT JOIN "con
hard gold: SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)

extra pred: SELECT s.name, s.location FROM stadium s JOIN concert c ON s.stad
extra gold: SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015

easy pred: SELECT COUNT(*) FROM Has_Pet JOIN Pets ON Has_Pet.Pet
easy gold: SELECT count(*) FROM pets WHERE weight  >  10

medium pred: SELECT MIN(pets.weight) AS min_weight FROM student JOIN has_pet
medium gold: SELECT weight FROM pets ORDER BY pet_age LIMIT 1

medium pred: SELECT p.pet_type, MAX(p.weight) AS max_weight FROM
medium gold: SELECT max(weight) ,  petType FROM pets GROUP BY petType

medium pred: SELECT COUNT(*) FROM Student WHERE age > 20
medium gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20

hard pred: SELECT COUNT(*) FROM Student s JOIN Has_Pet hp ON s.St
hard gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'

easy pred: SELECT COUNT(DISTINCT PetType) AS pet_types FROM Has_Pet
easy gold: SELECT count(DISTINCT pettype) FROM pets

extra pred: SELECT Student.Fname FROM Student JOIN Has_Pet ON Student.StuID =
extra gold: SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'

extra pred: SELECT Student.Fname FROM Student JOIN Has_Pet ON Student.StuID =
extra gold: select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat' intersect select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'dog'

extra pred: SELECT Student.Fname FROM Student JOIN Has_Pet ON Student.StuID =
extra gold: SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog'

hard pred: SELECT Student.StuID FROM Student LEFT JOIN Has_Pet ON Student.St
hard gold: SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'

hard pred: SELECT Student.LName FROM Student JOIN Has_Pet ON Student.StuID =
hard gold: SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'

medium pred: SELECT c.continent_id, c.continent_name, COUNT(c
medium gold: SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;

medium pred: SELECT car_makers.full_name, car_makers.id, COUNT(model
medium gold: SELECT T1.FullName ,  T1.Id ,  count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id;

hard pred: SELECT model_list.model, MIN(cars_data.horsepower) AS
hard gold: SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1;

extra pred: SELECT model_list.model FROM model_list JOIN cars_data ON model_list
extra gold: SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.Weight  <  (SELECT avg(Weight) FROM CARS_DATA)

extra pred: SELECT car_makers.maker FROM car_makers JOIN cars_data ON car_makers
extra gold: SELECT DISTINCT T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker JOIN CAR_NAMES AS T3 ON T2.model  =  T3.model JOIN CARS_DATA AS T4 ON T3.MakeId  =  T4.id WHERE T4.year  =  '1970';

extra pred: SELECT car_makers.maker, cars_data.year FROM car_makers JOIN cars
extra gold: SELECT T2.Make ,  T1.Year FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T1.Year  =  (SELECT min(YEAR) FROM CARS_DATA);

hard pred: SELECT DISTINCT cars_data.id, cars_data.mpg, cars
hard gold: SELECT DISTINCT T1.model FROM MODEL_LIST AS T1 JOIN CAR_NAMES AS T2 ON T1.model  =  T2.model JOIN CARS_DATA AS T3 ON T2.MakeId  =  T3.id WHERE T3.year  >  1980;

hard pred: SELECT c.continent, COUNT(cm.maker) AS maker_count FROM car
hard gold: SELECT T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.continent JOIN car_makers AS T3 ON T2.CountryId  =  T3.Country GROUP BY T1.Continent;

medium pred: SELECT car_makers.full_name, COUNT(car_names.makeid)
medium gold: select count(*) ,  t2.fullname from model_list as t1 join car_makers as t2 on t1.maker  =  t2.id group by t2.id;

easy pred: SELECT Country FROM airports WHERE "AirportName" ILIKE '%jetblue%air
easy gold: SELECT Country FROM AIRLINES WHERE Airline  =  "JetBlue Airways"

easy pred: SELECT airlines.uid, airlines.airline, airlines.abbreviation
easy gold: SELECT Abbreviation FROM AIRLINES WHERE Airline  =  "JetBlue Airways"

medium pred: SELECT airline, abbreviation FROM airlines WHERE country ILIKE '%USA%
medium gold: SELECT Airline ,  Abbreviation FROM AIRLINES WHERE Country  =  "USA"

medium pred: SELECT a.AirportCode, a.AirportName FROM airports a JOIN flights
medium gold: SELECT AirportCode ,  AirportName FROM AIRPORTS WHERE city  =  "Anthony"

medium pred: SELECT Country, city FROM airports WHERE portname ILIKE '%Alton%' LIMIT
medium gold: SELECT City ,  Country FROM AIRPORTS WHERE AirportName  =  "Alton"

hard pred: SELECT COUNT(*) FROM flights WHERE SourceAirport = 'Aberdeen' AND
hard gold: SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport  =  T3.AirportCode WHERE T2.City  =  "Ashley" AND T3.City  =  "Aberdeen"

hard pred: SELECT COUNT(*) FROM flights WHERE "Airline" = 21217
hard gold: SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode JOIN AIRLINES AS T3 ON T3.uid  =  T1.Airline WHERE T2.City  =  "Aberdeen" AND T3.Airline  =  "United Airlines"

extra pred: SELECT a.City, COUNT(f.FlightNo) AS num_flights
extra gold: SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport GROUP BY T1.City ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT airports.city, COUNT(flights.flightno) AS total_
extra gold: SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.SourceAirport GROUP BY T1.City ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT airports.airportcode, COUNT(flights.airline) AS flight
extra gold: SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport OR T1.AirportCode  =  T2.SourceAirport GROUP BY T1.AirportCode ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT COUNT(*) FROM flights WHERE (SourceAirport = 'ABZ' OR Dest
hard gold: SELECT count(*) FROM Flights AS T1 JOIN Airports AS T2 ON T1.DestAirport  =  T2.AirportCode WHERE T2.city  =  "Aberdeen" OR T2.city  =  "Abilene"

easy pred: SELECT e.name, e.age FROM employee e ORDER BY e.age ASC
easy gold: SELECT name FROM employee ORDER BY age

medium pred: SELECT city, COUNT(*) AS number_of_employees FROM employee GRO
medium gold: SELECT count(*) ,  city FROM employee GROUP BY city

medium pred: SELECT DISTINCT c.city FROM city c JOIN employee e ON c.city
medium gold: SELECT city FROM employee WHERE age  <  30 GROUP BY city HAVING count(*)  >  1

medium pred: SELECT shop.location, COUNT(*) AS number_of_shops FROM shop GRO
medium gold: SELECT count(*) ,  LOCATION FROM shop GROUP BY LOCATION

hard pred: SELECT shop.name FROM shop WHERE shop.number_products > (SELECT AVG(shop
hard gold: SELECT name FROM shop WHERE number_products  >  (SELECT avg(number_products) FROM shop)

extra pred: SELECT e.name, COUNT(e.employee_id) AS total_evalu
extra gold: SELECT t1.name FROM employee AS t1 JOIN evaluation AS t2 ON t1.Employee_ID  =  t2.Employee_ID GROUP BY t2.Employee_ID ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT e.name, to_number(e.year_awarded, '9
hard gold: SELECT t1.name FROM employee AS t1 JOIN evaluation AS t2 ON t1.Employee_ID  =  t2.Employee_ID ORDER BY t2.bonus DESC LIMIT 1

hard pred: SELECT e.name FROM employee e LEFT JOIN evaluation a ON e.employee_
hard gold: SELECT name FROM employee WHERE Employee_ID NOT IN (SELECT Employee_ID FROM evaluation)

extra pred: SELECT shop.name, COUNT(hiring.employee_id) AS employee_
extra gold: SELECT t2.name FROM hiring AS t1 JOIN shop AS t2 ON t1.shop_id  =  t2.shop_id GROUP BY t1.shop_id ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT SUM(bonus) AS total_bonus FROM evaluation
easy gold: SELECT sum(bonus) FROM evaluation

easy pred: SELECT COUNT(Document_ID) AS total_documents FROM Documents
easy gold: SELECT count(*) FROM Documents

medium pred: SELECT Documents.Document_ID, Documents.Document_Name, Documents.Document
medium gold: SELECT document_id ,  document_name ,  document_description FROM Documents

medium pred: SELECT Documents.Document_Name, Templates.Template_ID FROM Documents JOIN
medium gold: SELECT document_name ,  template_id FROM Documents WHERE Document_Description LIKE "%w%"

medium pred: SELECT Documents.Document_ID, Templates.Template_ID, Templates.Template
medium gold: SELECT document_id ,  template_id ,  Document_Description FROM Documents WHERE document_name  =  "Robbin CV"

easy pred: SELECT COUNT(DISTINCT templates.template_id) AS number_of_
easy gold: SELECT count(DISTINCT template_id) FROM Documents

extra pred: SELECT templates.template_id, ref_template_types.template_type_description FROM
extra gold: SELECT T1.template_id ,  T2.Template_Type_Code FROM Documents AS T1 JOIN Templates AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_id ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT t.template_id, COUNT(d.document_id) AS document_
easy gold: SELECT template_id FROM Documents GROUP BY template_id HAVING count(*)  >  1

hard pred: SELECT t.template_id FROM templates t LEFT JOIN documents d ON t.template
hard gold: SELECT template_id FROM Templates EXCEPT SELECT template_id FROM Documents

hard pred: SELECT Ref_Template_Types.Template_Type_Code, COUNT(Templates.
hard gold: SELECT template_type_code FROM Templates GROUP BY template_type_code ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT Ref_Template_Types.Template_Type_Code, COUNT(Documents.
extra gold: SELECT T1.template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_type_code ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT r.template_type_code FROM ref_template_types r LEFT JOIN
hard gold: SELECT template_type_code FROM Templates EXCEPT SELECT template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id

extra pred: SELECT Documents.Document_ID, Documents.Document_Name FROM Documents JOIN
extra gold: SELECT T1.document_id ,  T2.document_name FROM Paragraphs AS T1 JOIN Documents AS T2 ON T1.document_id  =  T2.document_id GROUP BY T1.document_id ORDER BY count(*) DESC LIMIT 1

medium pred: SELECT teacher.age, teacher.hometown FROM teacher JOIN course_arrange ON
medium gold: SELECT Age ,  Hometown FROM teacher

easy pred: SELECT teacher.name FROM teacher WHERE "Hometown" ILIKE '%little%
easy gold: select name from teacher where hometown != "little lever urban district"

medium pred: SELECT teacher.name FROM teacher WHERE (age::int = '32' OR age::
medium gold: SELECT Name FROM teacher WHERE Age  =  32 OR Age  =  33

medium pred: SELECT teacher.name, MIN(teacher.age) AS min_age FROM teacher JO
medium gold: SELECT Hometown FROM teacher ORDER BY Age ASC LIMIT 1

hard pred: SELECT teacher.name, COUNT(*) AS frequency FROM teacher JOIN course_arrange
hard gold: SELECT Hometown FROM teacher GROUP BY Hometown ORDER BY COUNT(*) DESC LIMIT 1

hard pred: SELECT t.name, c.course FROM teacher AS t CROSS JOIN course_
hard gold: SELECT T3.Name ,  T2.Course FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID ORDER BY T3.Name

hard pred: SELECT teacher.name FROM course JOIN course_arrange ON course.course_id =
hard gold: SELECT T3.Name FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID WHERE T2.Course  =  "Math"

medium pred: SELECT v.name, d.level_of_membership FROM visitor v JOIN visit
medium gold: SELECT name FROM visitor WHERE Level_of_membership  >  4 ORDER BY Level_of_membership DESC

easy pred: SELECT AVG(v.age) AS average_age FROM visitor v JOIN visit v
easy gold: SELECT avg(age) FROM visitor WHERE Level_of_membership  <=  4

medium pred: SELECT v.name, v.age, m.name AS museum_name, m.
medium gold: SELECT name ,  Level_of_membership FROM visitor WHERE Level_of_membership  >  4 ORDER BY age DESC

medium pred: SELECT m.museum_id, m.name FROM museum m JOIN (SELECT museum
medium gold: SELECT museum_id ,  name FROM museum ORDER BY num_of_staff DESC LIMIT 1

easy pred: SELECT AVG(museum.num_of_staff) AS average_staff FROM museum
easy gold: SELECT avg(num_of_staff) FROM museum WHERE open_year  <  2009

hard pred: SELECT m.name FROM museum m JOIN (SELECT museum_id FROM visit GROUP
hard gold: SELECT name FROM museum WHERE num_of_staff  >  (SELECT min(num_of_staff) FROM museum WHERE open_year  >  2010)

extra pred: SELECT v.name, m.name AS museum_name, v.level_of_
extra gold: SELECT t2.visitor_id ,  t1.name ,  t1.Level_of_membership FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id GROUP BY t2.visitor_id ORDER BY sum(t2.Total_spent) DESC LIMIT 1

extra pred: SELECT m.museum_id, m.name, COUNT(v.visitor
extra gold: SELECT t2.Museum_ID ,  t1.name FROM museum AS t1 JOIN visit AS t2 ON t1.Museum_ID  =  t2.Museum_ID GROUP BY t2.Museum_ID ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT m.name FROM museum m LEFT JOIN visit v ON m.museum_
hard gold: SELECT name FROM museum WHERE Museum_ID NOT IN (SELECT museum_id FROM visit)

hard pred: SELECT v.name, to_char(v.age,'YYYY-MM-DD
hard gold: SELECT t1.name ,  t1.age FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id ORDER BY t2.num_of_ticket DESC LIMIT 1

extra pred: SELECT v.name FROM visitor v JOIN visit v ON v.id = v.vis
extra gold: SELECT t1.name FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id JOIN museum AS t3 ON t3.Museum_ID  =  t2.Museum_ID WHERE t3.open_year  <  2009 INTERSECT SELECT t1.name FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id JOIN museum AS t3 ON t3.Museum_ID  =  t2.Museum_ID WHERE t3.open_year  >  2011

easy pred: SELECT COUNT(player_id) AS total_players FROM players
easy gold: SELECT count(*) FROM players

easy pred: SELECT COUNT(*) AS total_matches FROM matches
easy gold: SELECT count(*) FROM matches

medium pred: SELECT p.player_first_name, p.player_last_name, to_
medium gold: SELECT first_name ,  birth_date FROM players WHERE country_code  =  'USA'

medium pred: SELECT AVG(CASE WHEN p.player_id IN (SELECT loser_id
medium gold: SELECT avg(loser_age) ,  avg(winner_age) FROM matches

easy pred: SELECT AVG(winner_rank) AS average_winner_rank FROM matches
easy gold: SELECT avg(winner_rank) FROM matches

hard pred: SELECT players.player_name FROM players WHERE players.player_id IN (SELECT winner_
hard gold: SELECT winner_name FROM matches WHERE YEAR  =  2013 INTERSECT SELECT winner_name FROM matches WHERE YEAR  =  2016

medium pred: SELECT COUNT(*) FROM matches WHERE year IN (2013, 2
medium gold: SELECT count(*) FROM matches WHERE YEAR  =  2013 OR YEAR  =  2016

extra pred: SELECT players.player_id, players.first_name, players.last_name,
extra gold: SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN matches AS T2 ON T1.player_id  =  T2.winner_id WHERE T2.tourney_name  =  'WTA Championships' INTERSECT SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN matches AS T2 ON T1.player_id  =  T2.winner_id WHERE T2.tourney_name  =  'Australian Open'

hard pred: SELECT players.first_name, players.country_code FROM players WHERE players.
hard gold: SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN rankings AS T2 ON T1.player_id  =  T2.player_id ORDER BY T2.tours DESC LIMIT 1

hard pred: SELECT year FROM matches GROUP BY year ORDER BY COUNT(*) DESC
hard gold: SELECT YEAR FROM matches GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT COUNT(*) FROM ship WHERE name ilike '%Captured%'
easy gold: SELECT count(*) FROM ship WHERE disposition_of_ship  =  'Captured'

medium pred: SELECT "battle".name, "battle".date, "battle".result FROM
medium gold: SELECT name ,  date FROM battle

medium pred: SELECT MAX(death.killed) AS max_killed, MIN(death
medium gold: SELECT max(killed) ,  min(killed) FROM death

easy pred: SELECT AVG(injured) AS average_injuries FROM death WHERE killed IS
easy gold: SELECT avg(injured) FROM death

hard pred: SELECT b.id AS battle_id, b.name AS battle_name, COUNT
hard gold: SELECT T1.id ,  T1.name FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle JOIN death AS T3 ON T2.id  =  T3.caused_by_ship_id GROUP BY T1.id HAVING sum(T3.killed)  >  10

extra pred: SELECT ship.name, COUNT(death.killed) AS total_inj
extra gold: SELECT T2.id ,  T2.name FROM death AS T1 JOIN ship AS t2 ON T1.caused_by_ship_id  =  T2.id GROUP BY T2.id ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT COUNT(DISTINCT battle.id) FROM battle JOIN ship ON battle
extra gold: SELECT count(*) FROM battle WHERE id NOT IN ( SELECT lost_in_battle FROM ship WHERE tonnage  =  '225' );

extra pred: SELECT b.name, to_date(b.date, 'YYYY-MM-
extra gold: SELECT T1.name ,  T1.date FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle WHERE T2.name  =  'Lettice' INTERSECT SELECT T1.name ,  T1.date FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle WHERE T2.name  =  'HMS Atalanta'

medium pred: SELECT
medium gold: SELECT line_1 ,  line_2 FROM addresses

easy pred: SELECT
easy gold: SELECT count(*) FROM Courses

easy pred: SELECT
easy gold: SELECT course_description FROM Courses WHERE course_name  =  'math'

easy pred: SELECT

In [95]:
mistral_7b_instruct_scores = await evaluate(gold_path, mistral_7b_instruct_pred_path, db_dir, etype, kmaps, plug_value, keep_distinct, progress_bar_for_each_datapoint)

medium pred: SELECT Singer_Name, Country, Age FROM singer ORDER BY Age DESC
medium gold: SELECT name ,  country ,  age FROM singer ORDER BY age DESC

medium pred: SELECT AVG(Age), MIN(Age), MAX(Age) FROM
medium gold: SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'

medium pred: SELECT "Singer_Name", "Song_release_year" FROM "s
medium gold: SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1

hard pred: SELECT "Song_Name" FROM "singer"  INNER JOIN
hard gold: SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)

extra pred: SELECT Stadium_Name, Stadium_Capacity FROM stadium  JOIN concert ON stadium.
extra gold: SELECT T2.name ,  T2.capacity FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  >=  2014 GROUP BY T2.stadium_id ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT Stadium_Name, Stadium_Capacity FROM stadium  JOIN concert ON stadium.
extra gold: select t2.name ,  t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id  =  t2.stadium_id where t1.year  >  2013 group by t2.stadium_id order by count(*) desc limit 1

hard pred: SELECT Year FROM concert GROUP BY Year ORDER BY COUNT(*) DESC
hard gold: SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT Stadium_Name FROM stadium  WHERE Stadium_ID NOT IN (SELECT Stadium
hard gold: SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)

extra pred: SELECT Stadium_Name, Stadium_Location FROM stadium  JOIN concert ON stadium.
extra gold: SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015

medium pred: SELECT Pets.weight FROM Pets JOIN Has_Pet ON Pets.PetID
medium gold: SELECT weight FROM pets ORDER BY pet_age LIMIT 1

medium pred: SELECT PetType, MAX(weight) AS MaxWeight FROM Pets JOIN
medium gold: SELECT max(weight) ,  petType FROM pets GROUP BY petType

medium pred: SELECT COUNT(*) FROM Student  INNER JOIN Has_Pet ON Student
medium gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20

hard pred: SELECT COUNT(*) FROM Student  INNER JOIN Has_Pet ON Student
hard gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'

easy pred: SELECT DISTINCT PetType FROM Pets
easy gold: SELECT count(DISTINCT pettype) FROM pets

extra pred: SELECT Fname FROM Student WHERE StuID IN (SELECT StuID FROM Has_Pet
extra gold: SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'

extra pred: SELECT Fname FROM Student WHERE StuID IN (SELECT StuID FROM Has_Pet
extra gold: select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat' intersect select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'dog'

extra pred: SELECT s.Fname, s.LName FROM Student s JOIN Has
extra gold: SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog'

hard pred: SELECT StuID FROM Student  LEFT JOIN Has_Pet ON Student.Stu
hard gold: SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'

hard pred: SELECT LName FROM Student JOIN Has_Pet ON Student.StuID = Has_
hard gold: SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'

medium pred: SELECT ContId, Continent, COUNT(*) AS Countries FROM continents
medium gold: SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;

medium pred: SELECT car_makers.FullName, car_makers.Id, COUNT(*)
medium gold: SELECT T1.FullName ,  T1.Id ,  count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id;

hard pred: SELECT MIN(Horsepower) FROM cars_data
hard gold: SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1;

extra pred: SELECT Model FROM cars_data WHERE Weight < (SELECT AVG(Weight)
extra gold: SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.Weight  <  (SELECT avg(Weight) FROM CARS_DATA)

extra pred: SELECT car_makers.Maker, car_names.Make FROM car_makers
extra gold: SELECT DISTINCT T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker JOIN CAR_NAMES AS T3 ON T2.model  =  T3.model JOIN CARS_DATA AS T4 ON T3.MakeId  =  T4.id WHERE T4.year  =  '1970';

extra pred: SELECT      car_names.Make,      MIN(cars_
extra gold: SELECT T2.Make ,  T1.Year FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T1.Year  =  (SELECT min(YEAR) FROM CARS_DATA);

hard pred: SELECT DISTINCT Model FROM cars_data WHERE YEAR > 198
hard gold: SELECT DISTINCT T1.model FROM MODEL_LIST AS T1 JOIN CAR_NAMES AS T2 ON T1.model  =  T2.model JOIN CARS_DATA AS T3 ON T2.MakeId  =  T3.id WHERE T3.year  >  1980;

hard pred: SELECT continent.Continent, COUNT(*) as count FROM continents LEFT
hard gold: SELECT T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.continent JOIN car_makers AS T3 ON T2.CountryId  =  T3.Country GROUP BY T1.Continent;

medium pred: SELECT COUNT(*) AS Count, car_makers.FullName  FROM car
medium gold: select count(*) ,  t2.fullname from model_list as t1 join car_makers as t2 on t1.maker  =  t2.id group by t2.id;

easy pred: SELECT AVG(MPG) FROM cars_data WHERE Cylinders =
easy gold: SELECT avg(mpg) FROM CARS_DATA WHERE Cylinders  =  4;

easy pred: SELECT Abbreviation FROM airlines WHERE Airline = 'JetBlue Airways
easy gold: SELECT Abbreviation FROM AIRLINES WHERE Airline  =  "JetBlue Airways"

medium pred: SELECT City, Country FROM airports WHERE AirportCode = (SELECT DestAirport FROM flights
medium gold: SELECT City ,  Country FROM AIRPORTS WHERE AirportName  =  "Alton"

hard pred: SELECT COUNT(*) FROM flights WHERE SourceAirport = 'Aberdeen'
hard gold: SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport  =  T3.AirportCode WHERE T2.City  =  "Ashley" AND T3.City  =  "Aberdeen"

hard pred: SELECT COUNT(*) FROM flights WHERE Airline = 1 AND DestAirport =
hard gold: SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode JOIN AIRLINES AS T3 ON T3.uid  =  T1.Airline WHERE T2.City  =  "Aberdeen" AND T3.Airline  =  "United Airlines"

extra pred: SELECT City, COUNT(*) AS ArrivalCount FROM flights WHERE
extra gold: SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport GROUP BY T1.City ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT City, COUNT(*) AS DepartingFlights FROM flights W
extra gold: SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.SourceAirport GROUP BY T1.City ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT AirportCode, COUNT(*) AS FlightCount FROM flights GROUP BY Airport
extra gold: SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport OR T1.AirportCode  =  T2.SourceAirport GROUP BY T1.AirportCode ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT COUNT(*) FROM flights WHERE DestAirport IN ('Aberdeen',
hard gold: SELECT count(*) FROM Flights AS T1 JOIN Airports AS T2 ON T1.DestAirport  =  T2.AirportCode WHERE T2.city  =  "Aberdeen" OR T2.city  =  "Abilene"

easy pred: SELECT Employee_ID, Name, Age  FROM employee  ORDER BY Age
easy gold: SELECT name FROM employee ORDER BY age

medium pred: SELECT DISTINCT City FROM employee WHERE Age < 30 GROUP BY
medium gold: SELECT city FROM employee WHERE age  <  30 GROUP BY city HAVING count(*)  >  1

hard pred: SELECT Shop_Name FROM shop WHERE Number_products > (SELECT AVG(Number_
hard gold: SELECT name FROM shop WHERE number_products  >  (SELECT avg(number_products) FROM shop)

extra pred: SELECT Employee_Name FROM evaluation GROUP BY Employee_Name ORDER BY
extra gold: SELECT t1.name FROM employee AS t1 JOIN evaluation AS t2 ON t1.Employee_ID  =  t2.Employee_ID GROUP BY t2.Employee_ID ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT Employee_Name FROM evaluation WHERE Year_awarded = (SELECT MAX(
hard gold: SELECT t1.name FROM employee AS t1 JOIN evaluation AS t2 ON t1.Employee_ID  =  t2.Employee_ID ORDER BY t2.bonus DESC LIMIT 1

hard pred: SELECT Employee_Name FROM employee  INNER JOIN hiring ON employee.Em
hard gold: SELECT name FROM employee WHERE Employee_ID NOT IN (SELECT Employee_ID FROM evaluation)

extra pred: SELECT MAX(COUNT(DISTINCT Shop_ID)) FROM hiring
extra gold: SELECT t2.name FROM hiring AS t1 JOIN shop AS t2 ON t1.shop_id  =  t2.shop_id GROUP BY t1.shop_id ORDER BY count(*) DESC LIMIT 1

medium pred: SELECT Document_Name, Template_ID  FROM Documents  WHERE Document
medium gold: SELECT document_name ,  template_id FROM Documents WHERE Document_Description LIKE "%w%"

medium pred: SELECT Document_ID, Template_ID, Template_Type_Description FROM Documents
medium gold: SELECT document_id ,  template_id ,  Document_Description FROM Documents WHERE document_name  =  "Robbin CV"

extra pred: SELECT Template_ID, Template_Type_Code FROM Templates JOIN Doc
extra gold: SELECT T1.template_id ,  T2.Template_Type_Code FROM Documents AS T1 JOIN Templates AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_id ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT Template_ID, COUNT(*) AS Number_of_Documents FROM
easy gold: SELECT template_id FROM Documents GROUP BY template_id HAVING count(*)  >  1

hard pred: SELECT Templates.Template_ID FROM Templates LEFT JOIN Documents ON
hard gold: SELECT template_id FROM Templates EXCEPT SELECT template_id FROM Documents

hard pred: SELECT Template_Type_Code, COUNT(*) AS Number_of_Templates
hard gold: SELECT template_type_code FROM Templates GROUP BY template_type_code ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT Template_Type_Code, COUNT(*) AS Number_of_Documents
extra gold: SELECT T1.template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_type_code ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT Template_Type_Code FROM Ref_Template_Types WHERE Template_Type_Code
hard gold: SELECT template_type_code FROM Templates EXCEPT SELECT template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id

extra pred: SELECT Document_ID, Document_Name FROM Documents JOIN Paragraphs
extra gold: SELECT T1.document_id ,  T2.document_name FROM Paragraphs AS T1 JOIN Documents AS T2 ON T1.document_id  =  T2.document_id GROUP BY T1.document_id ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT Name FROM teacher WHERE Hometown <> 'Little Lever Urban District'
easy gold: select name from teacher where hometown != "little lever urban district"

hard pred: SELECT Hometown, COUNT(*) AS Count FROM teacher GROUP BY H
hard gold: SELECT Hometown FROM teacher GROUP BY Hometown ORDER BY COUNT(*) DESC LIMIT 1

hard pred: SELECT teacher.Name, course_arrange.Course FROM teacher INNER
hard gold: SELECT T3.Name ,  T2.Course FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID ORDER BY T3.Name

hard pred: SELECT Name FROM teacher  JOIN course_arrange ON teacher.Teacher
hard gold: SELECT T3.Name FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID WHERE T2.Course  =  "Math"

medium pred: SELECT visitor.Name  FROM visitor  INNER JOIN visit ON visitor.
medium gold: SELECT name FROM visitor WHERE Level_of_membership  >  4 ORDER BY Level_of_membership DESC

easy pred: SELECT AVG(Age) FROM visitor WHERE Level_of_membership <=
easy gold: SELECT avg(age) FROM visitor WHERE Level_of_membership  <=  4

medium pred: SELECT visitor.Name, visitor.Level_of_membership  FROM visitor
medium gold: SELECT name ,  Level_of_membership FROM visitor WHERE Level_of_membership  >  4 ORDER BY age DESC

medium pred: SELECT Museum_ID, Name FROM museum ORDER BY Num_of_Staff DES
medium gold: SELECT museum_id ,  name FROM museum ORDER BY num_of_staff DESC LIMIT 1

easy pred: SELECT AVG(Num_of_Staff) FROM museum  WHERE Open
easy gold: SELECT avg(num_of_staff) FROM museum WHERE open_year  <  2009

hard pred: SELECT Museum_Name FROM museum  JOIN visit ON museum.Museum_ID
hard gold: SELECT name FROM museum WHERE num_of_staff  >  (SELECT min(num_of_staff) FROM museum WHERE open_year  >  2010)

extra pred: SELECT visitor.ID, visitor.Name, visitor.Level_of_membership
extra gold: SELECT t2.visitor_id ,  t1.name ,  t1.Level_of_membership FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id GROUP BY t2.visitor_id ORDER BY sum(t2.Total_spent) DESC LIMIT 1

extra pred: SELECT Museum_ID, Name FROM visit GROUP BY Museum_ID, Name OR
extra gold: SELECT t2.Museum_ID ,  t1.name FROM museum AS t1 JOIN visit AS t2 ON t1.Museum_ID  =  t2.Museum_ID GROUP BY t2.Museum_ID ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT visitor.Name, visitor.Age  FROM visitor  INNER JO
hard gold: SELECT t1.name ,  t1.age FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id ORDER BY t2.num_of_ticket DESC LIMIT 1

extra pred: SELECT visitor.Name  FROM visitor  INNER JOIN visit ON visitor.
extra gold: SELECT t1.name FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id JOIN museum AS t3 ON t3.Museum_ID  =  t2.Museum_ID WHERE t3.open_year  <  2009 INTERSECT SELECT t1.name FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id JOIN museum AS t3 ON t3.Museum_ID  =  t2.Museum_ID WHERE t3.open_year  >  2011

medium pred: SELECT players.first_name, players.birth_date FROM players IN
medium gold: SELECT first_name ,  birth_date FROM players WHERE country_code  =  'USA'

medium pred: SELECT AVG(loser_age) AS loser_avg_age, AV
medium gold: SELECT avg(loser_age) ,  avg(winner_age) FROM matches

hard pred: SELECT winner_name FROM matches WHERE year = 2013 AND winner_name
hard gold: SELECT winner_name FROM matches WHERE YEAR  =  2013 INTERSECT SELECT winner_name FROM matches WHERE YEAR  =  2016

medium pred: SELECT COUNT(*) FROM matches WHERE year IN (2013, 2
medium gold: SELECT count(*) FROM matches WHERE YEAR  =  2013 OR YEAR  =  2016

extra pred: SELECT matches.winner_ioc, matches.winner_name FROM matches
extra gold: SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN matches AS T2 ON T1.player_id  =  T2.winner_id WHERE T2.tourney_name  =  'WTA Championships' INTERSECT SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN matches AS T2 ON T1.player_id  =  T2.winner_id WHERE T2.tourney_name  =  'Australian Open'

hard pred: SELECT player_name, country_code FROM players WHERE player_id IN
hard gold: SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN rankings AS T2 ON T1.player_id  =  T2.player_id ORDER BY T2.tours DESC LIMIT 1

hard pred: SELECT year FROM matches GROUP BY year ORDER BY COUNT(*) DESC
hard gold: SELECT YEAR FROM matches GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT COUNT(*) FROM ship WHERE disposition_of_ship = 'Captured
easy gold: SELECT count(*) FROM ship WHERE disposition_of_ship  =  'Captured'

medium pred: SELECT name, tonnage FROM ship ORDER BY name ASC, tonnage DES
medium gold: SELECT name ,  tonnage FROM ship ORDER BY name DESC

medium pred: SELECT name, date, result FROM battle
medium gold: SELECT name ,  date FROM battle

medium pred: SELECT MAX(killed) AS max_deaths, MIN(killed)
medium gold: SELECT max(killed) ,  min(killed) FROM death

easy pred: SELECT AVG(injured) FROM death WHERE caused_by_ship_id
easy gold: SELECT avg(injured) FROM death

hard pred: SELECT battle.id, battle.name FROM battle JOIN ship ON battle.
hard gold: SELECT T1.id ,  T1.name FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle JOIN death AS T3 ON T2.id  =  T3.caused_by_ship_id GROUP BY T1.id HAVING sum(T3.killed)  >  10

extra pred: SELECT ship.id, ship.name, SUM(death.injured
extra gold: SELECT T2.id ,  T2.name FROM death AS T1 JOIN ship AS t2 ON T1.caused_by_ship_id  =  T2.id GROUP BY T2.id ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT COUNT(*) FROM battle  WHERE id NOT IN (SELECT lost_
extra gold: SELECT count(*) FROM battle WHERE id NOT IN ( SELECT lost_in_battle FROM ship WHERE tonnage  =  '225' );

extra pred: SELECT battle.name, battle.date FROM battle INNER JOIN ship ON
extra gold: SELECT T1.name ,  T1.date FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle WHERE T2.name  =  'Lettice' INTERSECT SELECT T1.name ,  T1.date FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle WHERE T2.name  =  'HMS Atalanta'

medium pred: SELECT
medium gold: SELECT line_1 ,  line_2 FROM addresses

easy pred: SELECT
easy gold: SELECT count(*) FROM Courses

easy pred: SELECT
easy gold: SELECT course_description FROM Courses WHERE course_name  =  'math'

easy pred: SELECT
easy gold: SELECT zip_postcode FROM Addresses WHERE city  =  'Port Chelsea'

extra pred: SELECT
extra gold: SELECT T2.department_name ,  T1.department_id FROM Degree_Programs AS T1 JOIN Departments AS T2 ON T1.department_id  =  T2.department_id GROUP BY T1.department_id ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT
extra gold: select t2.department_name ,  t1.department_id from degree_programs as t1 join departments as t2 on t1.department_id  =  t2.department_id group by t1.department_id order by count(*) desc limit 1

medium pred: SELECT
medium gold: SELECT count(*) FROM Departments AS T1 JOIN Degree_Programs AS T2 ON T1.department_id  =  T2.department_id WHERE T1.department_name  =  'engineer'

medium pred: SELECT
medium gold: SELECT section_name ,  section_description FROM Sections

extra pred: SELECT
extra gold: SELECT T1.semester_name ,  T1.semester_id FROM Semesters AS T1 JOIN Student_Enrolment AS T2 ON T1.semester_id  =  T2.semester_id GROUP BY T1.semester_id ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT
hard gold: SELECT DISTINCT T1.first_name ,  T1.middle_name ,  T1.last_name FROM Students AS T1 JOIN Student_Enrolment AS T2 ON T1.student_id  =  T2.student_id JOIN Degree_Programs AS T3 ON T2.degree_program_id  =  T3.degree_program_id WHERE T3.degree_summary_name  =  'Bachelor'

hard pred: SELECT
hard gold: SELECT semester_name FROM Semesters WHERE semester_id NOT IN( SELECT semester_id FROM Student_Enrolment )

hard pred: SELECT
hard gold: SELECT count(*) ,  student_course_id FROM Transcript_Contents GROUP BY student_course_id ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT * FROM Cartoon WHERE Directed_by = 'Ben Jones'
easy gold: SELECT Title FROM Cartoon WHERE Directed_by = "Ben Jones";

easy pred: SELECT COUNT(*) FROM Cartoon WHERE Written_by = 'Joseph
easy gold: SELECT count(*) FROM Cartoon WHERE Written_by = "Joseph Kuhr";

medium pred: SELECT Cartoon.Title, Cartoon.Directed_by  FROM Cartoon  OR
medium gold: SELECT title ,  Directed_by FROM Cartoon ORDER BY Original_air_date

medium pred: SELECT Title FROM Cartoon WHERE Directed_by IN ('Ben Jones', 'Brandon Viet

In [96]:
mistral_7b_instruct_scores = await evaluate(gold_path, mistral_7b_instruct_pred_path, db_dir, etype, kmaps, plug_value, keep_distinct, progress_bar_for_each_datapoint)

medium pred: SELECT Singer_Name, Country, Age FROM singer ORDER BY Age DESC
medium gold: SELECT name ,  country ,  age FROM singer ORDER BY age DESC

medium pred: SELECT AVG(Age), MIN(Age), MAX(Age) FROM
medium gold: SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'

medium pred: SELECT "Singer_Name", "Song_release_year" FROM "s
medium gold: SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1

hard pred: SELECT "Song_Name" FROM "singer"  INNER JOIN
hard gold: SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)

extra pred: SELECT Stadium_Name, Stadium_Capacity FROM stadium  JOIN concert ON stadium.
extra gold: SELECT T2.name ,  T2.capacity FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  >=  2014 GROUP BY T2.stadium_id ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT Stadium_Name, Stadium_Capacity FROM stadium  JOIN concert ON stadium.
extra gold: select t2.name ,  t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id  =  t2.stadium_id where t1.year  >  2013 group by t2.stadium_id order by count(*) desc limit 1

hard pred: SELECT Year FROM concert GROUP BY Year ORDER BY COUNT(*) DESC
hard gold: SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT Stadium_Name FROM stadium  WHERE Stadium_ID NOT IN (SELECT Stadium
hard gold: SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)

extra pred: SELECT Stadium_Name, Stadium_Location FROM stadium  JOIN concert ON stadium.
extra gold: SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015

medium pred: SELECT Pets.weight FROM Pets JOIN Has_Pet ON Pets.PetID
medium gold: SELECT weight FROM pets ORDER BY pet_age LIMIT 1

medium pred: SELECT PetType, MAX(weight) AS MaxWeight FROM Pets JOIN
medium gold: SELECT max(weight) ,  petType FROM pets GROUP BY petType

medium pred: SELECT COUNT(*) FROM Student  INNER JOIN Has_Pet ON Student
medium gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20

hard pred: SELECT COUNT(*) FROM Student  INNER JOIN Has_Pet ON Student
hard gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'

easy pred: SELECT DISTINCT PetType FROM Pets
easy gold: SELECT count(DISTINCT pettype) FROM pets

extra pred: SELECT Fname FROM Student WHERE StuID IN (SELECT StuID FROM Has_Pet
extra gold: SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'

extra pred: SELECT Fname FROM Student WHERE StuID IN (SELECT StuID FROM Has_Pet
extra gold: select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat' intersect select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'dog'

extra pred: SELECT s.Fname, s.LName FROM Student s JOIN Has
extra gold: SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog'

hard pred: SELECT StuID FROM Student  LEFT JOIN Has_Pet ON Student.Stu
hard gold: SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'

hard pred: SELECT LName FROM Student JOIN Has_Pet ON Student.StuID = Has_
hard gold: SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'

medium pred: SELECT ContId, Continent, COUNT(*) AS Countries FROM continents
medium gold: SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;

medium pred: SELECT car_makers.FullName, car_makers.Id, COUNT(*)
medium gold: SELECT T1.FullName ,  T1.Id ,  count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id;

hard pred: SELECT MIN(Horsepower) FROM cars_data
hard gold: SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1;

extra pred: SELECT Model FROM cars_data WHERE Weight < (SELECT AVG(Weight)
extra gold: SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.Weight  <  (SELECT avg(Weight) FROM CARS_DATA)

extra pred: SELECT car_makers.Maker, car_names.Make FROM car_makers
extra gold: SELECT DISTINCT T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker JOIN CAR_NAMES AS T3 ON T2.model  =  T3.model JOIN CARS_DATA AS T4 ON T3.MakeId  =  T4.id WHERE T4.year  =  '1970';

extra pred: SELECT      car_names.Make,      MIN(cars_
extra gold: SELECT T2.Make ,  T1.Year FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T1.Year  =  (SELECT min(YEAR) FROM CARS_DATA);

hard pred: SELECT DISTINCT Model FROM cars_data WHERE YEAR > 198
hard gold: SELECT DISTINCT T1.model FROM MODEL_LIST AS T1 JOIN CAR_NAMES AS T2 ON T1.model  =  T2.model JOIN CARS_DATA AS T3 ON T2.MakeId  =  T3.id WHERE T3.year  >  1980;

hard pred: SELECT continent.Continent, COUNT(*) as count FROM continents LEFT
hard gold: SELECT T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.continent JOIN car_makers AS T3 ON T2.CountryId  =  T3.Country GROUP BY T1.Continent;

medium pred: SELECT COUNT(*) AS Count, car_makers.FullName  FROM car
medium gold: select count(*) ,  t2.fullname from model_list as t1 join car_makers as t2 on t1.maker  =  t2.id group by t2.id;

easy pred: SELECT AVG(MPG) FROM cars_data WHERE Cylinders =
easy gold: SELECT avg(mpg) FROM CARS_DATA WHERE Cylinders  =  4;

easy pred: SELECT Abbreviation FROM airlines WHERE Airline = 'JetBlue Airways
easy gold: SELECT Abbreviation FROM AIRLINES WHERE Airline  =  "JetBlue Airways"

medium pred: SELECT City, Country FROM airports WHERE AirportCode = (SELECT DestAirport FROM flights
medium gold: SELECT City ,  Country FROM AIRPORTS WHERE AirportName  =  "Alton"

hard pred: SELECT COUNT(*) FROM flights WHERE SourceAirport = 'Aberdeen'
hard gold: SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport  =  T3.AirportCode WHERE T2.City  =  "Ashley" AND T3.City  =  "Aberdeen"

hard pred: SELECT COUNT(*) FROM flights WHERE Airline = 1 AND DestAirport =
hard gold: SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode JOIN AIRLINES AS T3 ON T3.uid  =  T1.Airline WHERE T2.City  =  "Aberdeen" AND T3.Airline  =  "United Airlines"

extra pred: SELECT City, COUNT(*) AS ArrivalCount FROM flights WHERE
extra gold: SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport GROUP BY T1.City ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT City, COUNT(*) AS DepartingFlights FROM flights W
extra gold: SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.SourceAirport GROUP BY T1.City ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT AirportCode, COUNT(*) AS FlightCount FROM flights GROUP BY Airport
extra gold: SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport OR T1.AirportCode  =  T2.SourceAirport GROUP BY T1.AirportCode ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT COUNT(*) FROM flights WHERE DestAirport IN ('Aberdeen',
hard gold: SELECT count(*) FROM Flights AS T1 JOIN Airports AS T2 ON T1.DestAirport  =  T2.AirportCode WHERE T2.city  =  "Aberdeen" OR T2.city  =  "Abilene"

easy pred: SELECT Employee_ID, Name, Age  FROM employee  ORDER BY Age
easy gold: SELECT name FROM employee ORDER BY age

medium pred: SELECT DISTINCT City FROM employee WHERE Age < 30 GROUP BY
medium gold: SELECT city FROM employee WHERE age  <  30 GROUP BY city HAVING count(*)  >  1

hard pred: SELECT Shop_Name FROM shop WHERE Number_products > (SELECT AVG(Number_
hard gold: SELECT name FROM shop WHERE number_products  >  (SELECT avg(number_products) FROM shop)

extra pred: SELECT Employee_Name FROM evaluation GROUP BY Employee_Name ORDER BY
extra gold: SELECT t1.name FROM employee AS t1 JOIN evaluation AS t2 ON t1.Employee_ID  =  t2.Employee_ID GROUP BY t2.Employee_ID ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT Employee_Name FROM evaluation WHERE Year_awarded = (SELECT MAX(
hard gold: SELECT t1.name FROM employee AS t1 JOIN evaluation AS t2 ON t1.Employee_ID  =  t2.Employee_ID ORDER BY t2.bonus DESC LIMIT 1

hard pred: SELECT Employee_Name FROM employee  INNER JOIN hiring ON employee.Em
hard gold: SELECT name FROM employee WHERE Employee_ID NOT IN (SELECT Employee_ID FROM evaluation)

extra pred: SELECT MAX(COUNT(DISTINCT Shop_ID)) FROM hiring
extra gold: SELECT t2.name FROM hiring AS t1 JOIN shop AS t2 ON t1.shop_id  =  t2.shop_id GROUP BY t1.shop_id ORDER BY count(*) DESC LIMIT 1

medium pred: SELECT Document_Name, Template_ID  FROM Documents  WHERE Document
medium gold: SELECT document_name ,  template_id FROM Documents WHERE Document_Description LIKE "%w%"

medium pred: SELECT Document_ID, Template_ID, Template_Type_Description FROM Documents
medium gold: SELECT document_id ,  template_id ,  Document_Description FROM Documents WHERE document_name  =  "Robbin CV"

extra pred: SELECT Template_ID, Template_Type_Code FROM Templates JOIN Doc
extra gold: SELECT T1.template_id ,  T2.Template_Type_Code FROM Documents AS T1 JOIN Templates AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_id ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT Template_ID, COUNT(*) AS Number_of_Documents FROM
easy gold: SELECT template_id FROM Documents GROUP BY template_id HAVING count(*)  >  1

hard pred: SELECT Templates.Template_ID FROM Templates LEFT JOIN Documents ON
hard gold: SELECT template_id FROM Templates EXCEPT SELECT template_id FROM Documents

hard pred: SELECT Template_Type_Code, COUNT(*) AS Number_of_Templates
hard gold: SELECT template_type_code FROM Templates GROUP BY template_type_code ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT Template_Type_Code, COUNT(*) AS Number_of_Documents
extra gold: SELECT T1.template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_type_code ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT Template_Type_Code FROM Ref_Template_Types WHERE Template_Type_Code
hard gold: SELECT template_type_code FROM Templates EXCEPT SELECT template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id

extra pred: SELECT Document_ID, Document_Name FROM Documents JOIN Paragraphs
extra gold: SELECT T1.document_id ,  T2.document_name FROM Paragraphs AS T1 JOIN Documents AS T2 ON T1.document_id  =  T2.document_id GROUP BY T1.document_id ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT Name FROM teacher WHERE Hometown <> 'Little Lever Urban District'
easy gold: select name from teacher where hometown != "little lever urban district"

hard pred: SELECT Hometown, COUNT(*) AS Count FROM teacher GROUP BY H
hard gold: SELECT Hometown FROM teacher GROUP BY Hometown ORDER BY COUNT(*) DESC LIMIT 1

hard pred: SELECT teacher.Name, course_arrange.Course FROM teacher INNER
hard gold: SELECT T3.Name ,  T2.Course FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID ORDER BY T3.Name

hard pred: SELECT Name FROM teacher  JOIN course_arrange ON teacher.Teacher
hard gold: SELECT T3.Name FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID WHERE T2.Course  =  "Math"

medium pred: SELECT visitor.Name  FROM visitor  INNER JOIN visit ON visitor.
medium gold: SELECT name FROM visitor WHERE Level_of_membership  >  4 ORDER BY Level_of_membership DESC

easy pred: SELECT AVG(Age) FROM visitor WHERE Level_of_membership <=
easy gold: SELECT avg(age) FROM visitor WHERE Level_of_membership  <=  4

medium pred: SELECT visitor.Name, visitor.Level_of_membership  FROM visitor
medium gold: SELECT name ,  Level_of_membership FROM visitor WHERE Level_of_membership  >  4 ORDER BY age DESC

medium pred: SELECT Museum_ID, Name FROM museum ORDER BY Num_of_Staff DES
medium gold: SELECT museum_id ,  name FROM museum ORDER BY num_of_staff DESC LIMIT 1

easy pred: SELECT AVG(Num_of_Staff) FROM museum  WHERE Open
easy gold: SELECT avg(num_of_staff) FROM museum WHERE open_year  <  2009

hard pred: SELECT Museum_Name FROM museum  JOIN visit ON museum.Museum_ID
hard gold: SELECT name FROM museum WHERE num_of_staff  >  (SELECT min(num_of_staff) FROM museum WHERE open_year  >  2010)

extra pred: SELECT visitor.ID, visitor.Name, visitor.Level_of_membership
extra gold: SELECT t2.visitor_id ,  t1.name ,  t1.Level_of_membership FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id GROUP BY t2.visitor_id ORDER BY sum(t2.Total_spent) DESC LIMIT 1

extra pred: SELECT Museum_ID, Name FROM visit GROUP BY Museum_ID, Name OR
extra gold: SELECT t2.Museum_ID ,  t1.name FROM museum AS t1 JOIN visit AS t2 ON t1.Museum_ID  =  t2.Museum_ID GROUP BY t2.Museum_ID ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT visitor.Name, visitor.Age  FROM visitor  INNER JO
hard gold: SELECT t1.name ,  t1.age FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id ORDER BY t2.num_of_ticket DESC LIMIT 1

extra pred: SELECT visitor.Name  FROM visitor  INNER JOIN visit ON visitor.
extra gold: SELECT t1.name FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id JOIN museum AS t3 ON t3.Museum_ID  =  t2.Museum_ID WHERE t3.open_year  <  2009 INTERSECT SELECT t1.name FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id JOIN museum AS t3 ON t3.Museum_ID  =  t2.Museum_ID WHERE t3.open_year  >  2011

medium pred: SELECT players.first_name, players.birth_date FROM players IN
medium gold: SELECT first_name ,  birth_date FROM players WHERE country_code  =  'USA'

medium pred: SELECT AVG(loser_age) AS loser_avg_age, AV
medium gold: SELECT avg(loser_age) ,  avg(winner_age) FROM matches

hard pred: SELECT winner_name FROM matches WHERE year = 2013 AND winner_name
hard gold: SELECT winner_name FROM matches WHERE YEAR  =  2013 INTERSECT SELECT winner_name FROM matches WHERE YEAR  =  2016

medium pred: SELECT COUNT(*) FROM matches WHERE year IN (2013, 2
medium gold: SELECT count(*) FROM matches WHERE YEAR  =  2013 OR YEAR  =  2016

extra pred: SELECT matches.winner_ioc, matches.winner_name FROM matches
extra gold: SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN matches AS T2 ON T1.player_id  =  T2.winner_id WHERE T2.tourney_name  =  'WTA Championships' INTERSECT SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN matches AS T2 ON T1.player_id  =  T2.winner_id WHERE T2.tourney_name  =  'Australian Open'

hard pred: SELECT player_name, country_code FROM players WHERE player_id IN
hard gold: SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN rankings AS T2 ON T1.player_id  =  T2.player_id ORDER BY T2.tours DESC LIMIT 1

hard pred: SELECT year FROM matches GROUP BY year ORDER BY COUNT(*) DESC
hard gold: SELECT YEAR FROM matches GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT COUNT(*) FROM ship WHERE disposition_of_ship = 'Captured
easy gold: SELECT count(*) FROM ship WHERE disposition_of_ship  =  'Captured'

medium pred: SELECT name, tonnage FROM ship ORDER BY name ASC, tonnage DES
medium gold: SELECT name ,  tonnage FROM ship ORDER BY name DESC

medium pred: SELECT name, date, result FROM battle
medium gold: SELECT name ,  date FROM battle

medium pred: SELECT MAX(killed) AS max_deaths, MIN(killed)
medium gold: SELECT max(killed) ,  min(killed) FROM death

easy pred: SELECT AVG(injured) FROM death WHERE caused_by_ship_id
easy gold: SELECT avg(injured) FROM death

hard pred: SELECT battle.id, battle.name FROM battle JOIN ship ON battle.
hard gold: SELECT T1.id ,  T1.name FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle JOIN death AS T3 ON T2.id  =  T3.caused_by_ship_id GROUP BY T1.id HAVING sum(T3.killed)  >  10

extra pred: SELECT ship.id, ship.name, SUM(death.injured
extra gold: SELECT T2.id ,  T2.name FROM death AS T1 JOIN ship AS t2 ON T1.caused_by_ship_id  =  T2.id GROUP BY T2.id ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT COUNT(*) FROM battle  WHERE id NOT IN (SELECT lost_
extra gold: SELECT count(*) FROM battle WHERE id NOT IN ( SELECT lost_in_battle FROM ship WHERE tonnage  =  '225' );

extra pred: SELECT battle.name, battle.date FROM battle INNER JOIN ship ON
extra gold: SELECT T1.name ,  T1.date FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle WHERE T2.name  =  'Lettice' INTERSECT SELECT T1.name ,  T1.date FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle WHERE T2.name  =  'HMS Atalanta'

medium pred: SELECT
medium gold: SELECT line_1 ,  line_2 FROM addresses

easy pred: SELECT
easy gold: SELECT count(*) FROM Courses

easy pred: SELECT
easy gold: SELECT course_description FROM Courses WHERE course_name  =  'math'

easy pred: SELECT
easy gold: SELECT zip_postcode FROM Addresses WHERE city  =  'Port Chelsea'

extra pred: SELECT
extra gold: SELECT T2.department_name ,  T1.department_id FROM Degree_Programs AS T1 JOIN Departments AS T2 ON T1.department_id  =  T2.department_id GROUP BY T1.department_id ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT
extra gold: select t2.department_name ,  t1.department_id from degree_programs as t1 join departments as t2 on t1.department_id  =  t2.department_id group by t1.department_id order by count(*) desc limit 1

medium pred: SELECT
medium gold: SELECT count(*) FROM Departments AS T1 JOIN Degree_Programs AS T2 ON T1.department_id  =  T2.department_id WHERE T1.department_name  =  'engineer'

medium pred: SELECT
medium gold: SELECT section_name ,  section_description FROM Sections

extra pred: SELECT
extra gold: SELECT T1.semester_name ,  T1.semester_id FROM Semesters AS T1 JOIN Student_Enrolment AS T2 ON T1.semester_id  =  T2.semester_id GROUP BY T1.semester_id ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT
hard gold: SELECT DISTINCT T1.first_name ,  T1.middle_name ,  T1.last_name FROM Students AS T1 JOIN Student_Enrolment AS T2 ON T1.student_id  =  T2.student_id JOIN Degree_Programs AS T3 ON T2.degree_program_id  =  T3.degree_program_id WHERE T3.degree_summary_name  =  'Bachelor'

hard pred: SELECT
hard gold: SELECT semester_name FROM Semesters WHERE semester_id NOT IN( SELECT semester_id FROM Student_Enrolment )

hard pred: SELECT
hard gold: SELECT count(*) ,  student_course_id FROM Transcript_Contents GROUP BY student_course_id ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT * FROM Cartoon WHERE Directed_by = 'Ben Jones'
easy gold: SELECT Title FROM Cartoon WHERE Directed_by = "Ben Jones";

easy pred: SELECT COUNT(*) FROM Cartoon WHERE Written_by = 'Joseph
easy gold: SELECT count(*) FROM Cartoon WHERE Written_by = "Joseph Kuhr";

medium pred: SELECT Cartoon.Title, Cartoon.Directed_by  FROM Cartoon  OR
medium gold: SELECT title ,  Directed_by FROM Cartoon ORDER BY Original_air_date

medium pred: SELECT Title FROM Cartoon WHERE Directed_by IN ('Ben Jones', 'Brandon Viet

In [97]:
task = await evaluate(gold_path, pred_path, db_dir, etype, kmaps, plug_value, keep_distinct, progress_bar_for_each_datapoint)

medium pred: SELECT name, country, age FROM singer WHERE age = (SELECT MIN(age)
medium gold: SELECT name ,  country ,  age FROM singer ORDER BY age DESC

medium pred: SELECT average(age), MIN(age), MAX(age) FROM singer WHERE country =
medium gold: SELECT avg(age) ,  min(age) ,  max(age) FROM singer WHERE country  =  'France'

medium pred: SELECT Name, Song_release_year FROM singer WHERE Age < (SELECT MIN(Age
medium gold: SELECT song_name ,  song_release_year FROM singer ORDER BY age LIMIT 1

easy pred: SELECT "Country" FROM "singer" WHERE "Age" > 20
easy gold: SELECT DISTINCT country FROM singer WHERE age  >  20

hard pred: SELECT "Name" FROM "singer_in_concert" WHERE "Singer
hard gold: SELECT song_name FROM singer WHERE age  >  (SELECT avg(age) FROM singer)

extra pred: SELECT name, capacity FROM stadium WHERE year > 2014
extra gold: SELECT T2.name ,  T2.capacity FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.year  >=  2014 GROUP BY T2.stadium_id ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT name, capacity FROM stadium WHERE year > 2013
extra gold: select t2.name ,  t2.capacity from concert as t1 join stadium as t2 on t1.stadium_id  =  t2.stadium_id where t1.year  >  2013 group by t2.stadium_id order by count(*) desc limit 1

hard pred: SELECT     year(concerts.Year) as year,
hard gold: SELECT YEAR FROM concert GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT "Name" FROM "stadium" WHERE "Stadium_ID" NOT
hard gold: SELECT name FROM stadium WHERE stadium_id NOT IN (SELECT stadium_id FROM concert)

extra pred: SELECT name, location FROM stadium WHERE exists (SELECT 1 FROM concert WHERE year =
extra gold: SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2014 INTERSECT SELECT T2.name ,  T2.location FROM concert AS T1 JOIN stadium AS T2 ON T1.stadium_id  =  T2.stadium_id WHERE T1.Year  =  2015

easy pred: SELECT COUNT(*) FROM Has_Pet WHERE weight > 10
easy gold: SELECT count(*) FROM pets WHERE weight  >  10

medium pred: SELECT weight FROM Pets WHERE Major = 1
medium gold: SELECT weight FROM pets ORDER BY pet_age LIMIT 1

medium pred: SELECT PetType, MAX(weight)  FROM Pets  GROUP BY Pet
medium gold: SELECT max(weight) ,  petType FROM pets GROUP BY petType

medium pred: SELECT COUNT(*) FROM Has_Pet WHERE Student.Age > 20
medium gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid WHERE T1.age  >  20

hard pred: SELECT COUNT(*) FROM Has_Pet WHERE Sex = 'F' AND PetType =
hard gold: SELECT count(*) FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T2.petid  =  T3.petid WHERE T1.sex  =  'F' AND T3.pettype  =  'dog'

easy pred: SELECT DISTINCT PetType FROM Has_Pet
easy gold: SELECT count(DISTINCT pettype) FROM pets

extra pred: SELECT Fname FROM Student WHERE Major = 1 AND (SELECT COUNT(*) FROM Has_
extra gold: SELECT DISTINCT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' OR T3.pettype  =  'dog'

extra pred: SELECT Fname FROM Student WHERE Has_Pet.StuID = Student.St
extra gold: select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'cat' intersect select t1.fname from student as t1 join has_pet as t2 on t1.stuid  =  t2.stuid join pets as t3 on t3.petid  =  t2.petid where t3.pettype  =  'dog'

extra pred: SELECT Fname FROM Student WHERE Has_Pet.StuID IN (SELECT
extra gold: SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat' INTERSECT SELECT T1.Fname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'dog'

hard pred: SELECT StuID FROM Has_Pet WHERE PetType = 'cat'
hard gold: SELECT stuid FROM student EXCEPT SELECT T1.stuid FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pettype  =  'cat'

hard pred: SELECT LName FROM Student WHERE Major = 1 AND Age = 3 AND Sex =
hard gold: SELECT T1.lname FROM student AS T1 JOIN has_pet AS T2 ON T1.stuid  =  T2.stuid JOIN pets AS T3 ON T3.petid  =  T2.petid WHERE T3.pet_age  =  3 AND T3.pettype  =  'cat'

medium pred: SELECT continents.ContId, continents.Continent, COUNT(*) as num
medium gold: SELECT T1.ContId ,  T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.Continent GROUP BY T1.ContId;

medium pred: SELECT maker, COUNT(*) as num_models FROM car_makers
medium gold: SELECT T1.FullName ,  T1.Id ,  count(*) FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker GROUP BY T1.Id;

hard pred: SELECT * FROM cars_data WHERE Horsepower = (SELECT MIN(Horse
hard gold: SELECT T1.Model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id ORDER BY T2.horsepower ASC LIMIT 1;

extra pred: SELECT       "Model"  FROM       "car_names"
extra gold: SELECT T1.model FROM CAR_NAMES AS T1 JOIN CARS_DATA AS T2 ON T1.MakeId  =  T2.Id WHERE T2.Weight  <  (SELECT avg(Weight) FROM CARS_DATA)

extra pred: SELECT maker FROM car_names WHERE year = 1970
extra gold: SELECT DISTINCT T1.Maker FROM CAR_MAKERS AS T1 JOIN MODEL_LIST AS T2 ON T1.Id  =  T2.Maker JOIN CAR_NAMES AS T3 ON T2.model  =  T3.model JOIN CARS_DATA AS T4 ON T3.MakeId  =  T4.id WHERE T4.year  =  '1970';

extra pred: SELECT    car_names.Make,    cars_
extra gold: SELECT T2.Make ,  T1.Year FROM CARS_DATA AS T1 JOIN CAR_NAMES AS T2 ON T1.Id  =  T2.MakeId WHERE T1.Year  =  (SELECT min(YEAR) FROM CARS_DATA);

hard pred: SELECT distinct(Model) FROM "car_names" WHERE "Year" > 1
hard gold: SELECT DISTINCT T1.model FROM MODEL_LIST AS T1 JOIN CAR_NAMES AS T2 ON T1.model  =  T2.model JOIN CARS_DATA AS T3 ON T2.MakeId  =  T3.id WHERE T3.year  >  1980;

hard pred: SELECT continent, COUNT(*) as num_car_makers FROM car_m
hard gold: SELECT T1.Continent ,  count(*) FROM CONTINENTS AS T1 JOIN COUNTRIES AS T2 ON T1.ContId  =  T2.continent JOIN car_makers AS T3 ON T2.CountryId  =  T3.Country GROUP BY T1.Continent;

medium pred: SELECT maker, COUNT(*) as count FROM car_names JOIN car
medium gold: select count(*) ,  t2.fullname from model_list as t1 join car_makers as t2 on t1.maker  =  t2.id group by t2.id;

easy pred: SELECT mpg FROM cars_data WHERE Cylinders = 4
easy gold: SELECT avg(mpg) FROM CARS_DATA WHERE Cylinders  =  4;

easy pred: SELECT Country FROM flights WHERE Airline = 'JetBlue Airways'
easy gold: SELECT Country FROM AIRLINES WHERE Airline  =  "JetBlue Airways"

easy pred: SELECT Abbreviation FROM airlines WHERE Airline = 'JetBlue Airways
easy gold: SELECT Abbreviation FROM AIRLINES WHERE Airline  =  "JetBlue Airways"

medium pred: SELECT AirportName, Country FROM airports WHERE AirportCode = 'AEX'
medium gold: SELECT City ,  Country FROM AIRPORTS WHERE AirportName  =  "Alton"

hard pred: SELECT COUNT(*) FROM flights WHERE SourceAirport = 'Aberde
hard gold: SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode JOIN AIRPORTS AS T3 ON T1.SourceAirport  =  T3.AirportCode WHERE T2.City  =  "Ashley" AND T3.City  =  "Aberdeen"

hard pred: SELECT COUNT(*) FROM flights WHERE Airline = 'United Airlines'
hard gold: SELECT count(*) FROM FLIGHTS AS T1 JOIN AIRPORTS AS T2 ON T1.DestAirport  =  T2.AirportCode JOIN AIRLINES AS T3 ON T3.uid  =  T1.Airline WHERE T2.City  =  "Aberdeen" AND T3.Airline  =  "United Airlines"

extra pred: SELECT City, COUNT(*) as num_flights FROM flights GROUP
extra gold: SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport GROUP BY T1.City ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT City, COUNT(*) as num_departing_flights FROM air
extra gold: SELECT T1.City FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.SourceAirport GROUP BY T1.City ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT airports.AirportName, COUNT(*) as num_flights
extra gold: SELECT T1.AirportCode FROM AIRPORTS AS T1 JOIN FLIGHTS AS T2 ON T1.AirportCode  =  T2.DestAirport OR T1.AirportCode  =  T2.SourceAirport GROUP BY T1.AirportCode ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT COUNT(*) FROM flights WHERE SourceAirport = 'ABZ' OR Dest
hard gold: SELECT count(*) FROM Flights AS T1 JOIN Airports AS T2 ON T1.DestAirport  =  T2.AirportCode WHERE T2.city  =  "Aberdeen" OR T2.city  =  "Abilene"

easy pred: SELECT * FROM employee WHERE Age > (SELECT AVG(Age) FROM employee)
easy gold: SELECT name FROM employee ORDER BY age

medium pred: SELECT City, COUNT(*) as num_employees FROM hiring
medium gold: SELECT count(*) ,  city FROM employee GROUP BY city

medium pred: SELECT City FROM employee WHERE Age < 30
medium gold: SELECT city FROM employee WHERE age  <  30 GROUP BY city HAVING count(*)  >  1

medium pred: SELECT Location, COUNT(*) as num_shops   FROM shop   GROUP BY
medium gold: SELECT count(*) ,  LOCATION FROM shop GROUP BY LOCATION

hard pred: SELECT * FROM shop WHERE number_products > (SELECT AVG(number_products)
hard gold: SELECT name FROM shop WHERE number_products  >  (SELECT avg(number_products) FROM shop)

extra pred: SELECT name FROM evaluation WHERE year_awarded = (SELECT MAX(year_a
extra gold: SELECT t1.name FROM employee AS t1 JOIN evaluation AS t2 ON t1.Employee_ID  =  t2.Employee_ID GROUP BY t2.Employee_ID ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT name FROM employee WHERE bonus > (SELECT MAX(bonus) FROM evaluation)
hard gold: SELECT t1.name FROM employee AS t1 JOIN evaluation AS t2 ON t1.Employee_ID  =  t2.Employee_ID ORDER BY t2.bonus DESC LIMIT 1

hard pred: SELECT Employee_ID FROM hiring WHERE Is_full_time = 0
hard gold: SELECT name FROM employee WHERE Employee_ID NOT IN (SELECT Employee_ID FROM evaluation)

extra pred: SELECT Shop_ID, COUNT(*) as num_employees  FROM hiring
extra gold: SELECT t2.name FROM hiring AS t1 JOIN shop AS t2 ON t1.shop_id  =  t2.shop_id GROUP BY t1.shop_id ORDER BY count(*) DESC LIMIT 1

medium pred: SELECT Documents.Document_ID, Documents.Document_Name, Documents.
medium gold: SELECT document_id ,  document_name ,  document_description FROM Documents

medium pred: SELECT Document_Name, Template_ID FROM Documents WHERE Document_Description
medium gold: SELECT document_name ,  template_id FROM Documents WHERE Document_Description LIKE "%w%"

medium pred: SELECT Document_ID, Template_ID, Template_Description FROM Documents
medium gold: SELECT document_id ,  template_id ,  Document_Description FROM Documents WHERE document_name  =  "Robbin CV"

easy pred: SELECT COUNT(*) FROM Documents WHERE Template_ID IS NOT NULL
easy gold: SELECT count(DISTINCT template_id) FROM Documents

extra pred: SELECT Template_Type_Code, COUNT(*) as num_docs FROM Documents
extra gold: SELECT T1.template_id ,  T2.Template_Type_Code FROM Documents AS T1 JOIN Templates AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_id ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT Template_ID FROM Templates WHERE EXISTS (SELECT 1 FROM Documents WHERE Template
easy gold: SELECT template_id FROM Documents GROUP BY template_id HAVING count(*)  >  1

hard pred: SELECT Template_ID FROM Templates WHERE NOT EXISTS (SELECT 1 FROM Documents WHERE
hard gold: SELECT template_id FROM Templates EXCEPT SELECT template_id FROM Documents

hard pred: SELECT Template_Type_Code, COUNT(*) as num_templates FROM Tem
hard gold: SELECT template_type_code FROM Templates GROUP BY template_type_code ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT Template_Type_Code, COUNT(*) as num_of_documents
extra gold: SELECT T1.template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id GROUP BY T1.template_type_code ORDER BY count(*) DESC LIMIT 1

hard pred: SELECT Template_Type_Code FROM Ref_Template_Types WHERE NOT EXISTS (SELECT
hard gold: SELECT template_type_code FROM Templates EXCEPT SELECT template_type_code FROM Templates AS T1 JOIN Documents AS T2 ON T1.template_id  =  T2.template_id

extra pred: SELECT Document_ID, Document_Name, COUNT(*) as Num_Paragraphs
extra gold: SELECT T1.document_id ,  T2.document_name FROM Paragraphs AS T1 JOIN Documents AS T2 ON T1.document_id  =  T2.document_id GROUP BY T1.document_id ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT "Teacher".* FROM "course_arrange" JOIN "teacher"
easy gold: SELECT Name FROM teacher ORDER BY Age ASC

medium pred: SELECT "Teacher".* FROM "course_arrange" JOIN "teacher"
medium gold: SELECT Age ,  Hometown FROM teacher

easy pred: SELECT name FROM teacher WHERE hometown NOT LIKE '%Little Lever Urban District
easy gold: select name from teacher where hometown != "little lever urban district"

medium pred: SELECT "Teacher".* FROM "course_arrange" JOIN "teacher"
medium gold: SELECT Name FROM teacher WHERE Age  =  32 OR Age  =  33

medium pred: SELECT hometown FROM teacher WHERE age = (SELECT MIN(age) FROM teacher)
medium gold: SELECT Hometown FROM teacher ORDER BY Age ASC LIMIT 1

hard pred: SELECT hometown FROM teacher WHERE grade = (SELECT MAX(grade) FROM course_
hard gold: SELECT Hometown FROM teacher GROUP BY Hometown ORDER BY COUNT(*) DESC LIMIT 1

hard pred: SELECT "Teacher".* FROM "course_arrange" JOIN "teacher"
hard gold: SELECT T3.Name ,  T2.Course FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID ORDER BY T3.Name

hard pred: SELECT name FROM teacher WHERE course_id = (SELECT course_id FROM course_ar
hard gold: SELECT T3.Name FROM course_arrange AS T1 JOIN course AS T2 ON T1.Course_ID  =  T2.Course_ID JOIN teacher AS T3 ON T1.Teacher_ID  =  T3.Teacher_ID WHERE T2.Course  =  "Math"

medium pred: SELECT visitor.Name,         (SELECT level_of_membership
medium gold: SELECT name FROM visitor WHERE Level_of_membership  >  4 ORDER BY Level_of_membership DESC

easy pred: SELECT AVG(Age) FROM visitor WHERE Level_of_membership < 4
easy gold: SELECT avg(age) FROM visitor WHERE Level_of_membership  <=  4

medium pred: SELECT v.Name, v.Level_of_membership FROM visitor
medium gold: SELECT name ,  Level_of_membership FROM visitor WHERE Level_of_membership  >  4 ORDER BY age DESC

medium pred: SELECT Museum_ID, Name FROM museum GROUP BY Museum_ID ORDER
medium gold: SELECT museum_id ,  name FROM museum ORDER BY num_of_staff DESC LIMIT 1

easy pred: SELECT      AVG(Num_of_Staff) FROM
easy gold: SELECT avg(num_of_staff) FROM museum WHERE open_year  <  2009

hard pred: SELECT name FROM museum WHERE open_year > '2010' AND staff
hard gold: SELECT name FROM museum WHERE num_of_staff  >  (SELECT min(num_of_staff) FROM museum WHERE open_year  >  2010)

extra pred: SELECT visitor.Name, visitor.Level_of_membership FROM visitor
extra gold: SELECT t2.visitor_id ,  t1.name ,  t1.Level_of_membership FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id GROUP BY t2.visitor_id ORDER BY sum(t2.Total_spent) DESC LIMIT 1

extra pred: SELECT name, COUNT(*) as num_visits FROM visit GROUP BY name
extra gold: SELECT t2.Museum_ID ,  t1.name FROM museum AS t1 JOIN visit AS t2 ON t1.Museum_ID  =  t2.Museum_ID GROUP BY t2.Museum_ID ORDER BY count(*) DESC LIMIT 1

hard pred: select * from museum where num_of_staff = 0
hard gold: SELECT name FROM museum WHERE Museum_ID NOT IN (SELECT museum_id FROM visit)

hard pred: SELECT name, age FROM visitor WHERE num_of_ticket = (SELECT MAX(num
hard gold: SELECT t1.name ,  t1.age FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id ORDER BY t2.num_of_ticket DESC LIMIT 1

extra pred: SELECT visitor.Name FROM visitor JOIN visit ON visitor.ID = visit
extra gold: SELECT t1.name FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id JOIN museum AS t3 ON t3.Museum_ID  =  t2.Museum_ID WHERE t3.open_year  <  2009 INTERSECT SELECT t1.name FROM visitor AS t1 JOIN visit AS t2 ON t1.id  =  t2.visitor_id JOIN museum AS t3 ON t3.Museum_ID  =  t2.Museum_ID WHERE t3.open_year  >  2011

easy pred: SELECT
easy gold: SELECT count(*) FROM players

easy pred: SELECT
easy gold: SELECT count(*) FROM matches

medium pred: SELECT
medium gold: SELECT first_name ,  birth_date FROM players WHERE country_code  =  'USA'

medium pred: SELECT
medium gold: SELECT avg(loser_age) ,  avg(winner_age) FROM matches

easy pred: SELECT
easy gold: SELECT avg(winner_rank) FROM matches

hard pred: SELECT
hard gold: SELECT winner_name FROM matches WHERE YEAR  =  2013 INTERSECT SELECT winner_name FROM matches WHERE YEAR  =  2016

medium pred: SELECT
medium gold: SELECT count(*) FROM matches WHERE YEAR  =  2013 OR YEAR  =  2016

extra pred: SELECT
extra gold: SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN matches AS T2 ON T1.player_id  =  T2.winner_id WHERE T2.tourney_name  =  'WTA Championships' INTERSECT SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN matches AS T2 ON T1.player_id  =  T2.winner_id WHERE T2.tourney_name  =  'Australian Open'

hard pred: SELECT
hard gold: SELECT T1.country_code ,  T1.first_name FROM players AS T1 JOIN rankings AS T2 ON T1.player_id  =  T2.player_id ORDER BY T2.tours DESC LIMIT 1

hard pred: SELECT
hard gold: SELECT YEAR FROM matches GROUP BY YEAR ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT    COUNT(*)  FROM    ship  WHERE
easy gold: SELECT count(*) FROM ship WHERE disposition_of_ship  =  'Captured'

medium pred: SELECT name, date, result FROM battle
medium gold: SELECT name ,  date FROM battle

medium pred: SELECT      MIN(death.killed),      MAX
medium gold: SELECT max(killed) ,  min(killed) FROM death

hard pred: SELECT id, name, COUNT(*) as num_killed FROM battle J
hard gold: SELECT T1.id ,  T1.name FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle JOIN death AS T3 ON T2.id  =  T3.caused_by_ship_id GROUP BY T1.id HAVING sum(T3.killed)  >  10

extra pred: SELECT ship.name, SUM(injured) AS total_injuries
extra gold: SELECT T2.id ,  T2.name FROM death AS T1 JOIN ship AS t2 ON T1.caused_by_ship_id  =  T2.id GROUP BY T2.id ORDER BY count(*) DESC LIMIT 1

easy pred: SELECT * FROM battle
easy gold: SELECT count(DISTINCT RESULT) FROM battle

extra pred: SELECT * FROM battle WHERE lost_in_battle = 0 AND tonn
extra gold: SELECT count(*) FROM battle WHERE id NOT IN ( SELECT lost_in_battle FROM ship WHERE tonnage  =  '225' );

extra pred: SELECT name, date FROM battle WHERE lost_in_battle = (
extra gold: SELECT T1.name ,  T1.date FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle WHERE T2.name  =  'Lettice' INTERSECT SELECT T1.name ,  T1.date FROM battle AS T1 JOIN ship AS T2 ON T1.id  =  T2.lost_in_battle WHERE T2.name  =  'HMS Atalanta'

medium pred: SELECT
medium gold: SELECT line_1 ,  line_2 FROM addresses

easy pred: SELECT
easy gold: SELECT count(*) FROM Courses

easy pred: SELECT
easy gold: SELECT course_description FROM Courses WHERE course_name  =  'math'

easy pred: SELECT
easy gold: SELECT zip_postcode FROM Addresses WHERE city  =  'Port Chelsea'

extra pred: SELECT
extra gold: SELECT T2.department_name ,  T1.department_id FROM Degree_Programs AS T1 JOIN Departments AS T2 ON T1.department_id  =  T2.department_id GROUP BY T1.department_id ORDER BY count(*) DESC LIMIT 1

extra pred: SELECT
extra gold: select t2.department_name ,  t1.department_id from degree_programs as t1 join departments as t2 on t1.department_id  =  t2.department_id group by t1.department_id order by count(*) desc limit 1

medium pred: SELECT
medium gold: SELECT count(*) FROM Departments AS T1 JOIN Degree_Programs AS T2 ON T1.department_id  =  T2.department_id WHERE T1.department_name  =  'engineer'

medium pred: SELECT
medium gold: SELECT section_name ,  section_description FROM Sections

extra pred: SELECT
extra gold: SELECT T1.semester_name ,  T1.semester_id FROM Semesters AS T1 JOIN Student_Enrolment AS T2 ON T1.semester_id  =  T2.semester_id GROUP BY T1.semester_id ORDER BY count(*) DESC LIMIT 1


In [100]:
import pickle

In [101]:
scores_7b = {
    'llama_7b_scores': llama_7b_scores,
    'llama_7b_complex_scores': llama_7b_complex_scores,
    'defog_sqlcoder_7b_scores': defog_sqlcoder_7b_scores,
    'defog_sqlcoder_7b_complex_scores': defog_sqlcoder_7b_complex_scores,
    'mistral_7b_instruct_scores': mistral_7b_instruct_scores,
    'mistral_7b_instruct_scores': mistral_7b_instruct_scores,
}

In [102]:
# pickle scores_7b
with open('scores_7b.pickle', 'wb') as handle:
    pickle.dump(scores_7b, handle, protocol=pickle.HIGHEST_PROTOCOL)

In [103]:
import pandas as pd

def flatten_scores(scores):
    flat_scores = {}
    for difficulty_level, metrics in scores.items():
        for metric, values in metrics.items():
            if isinstance(values, dict):
                for sub_metric, value in values.items():
                    flat_key = f"{difficulty_level}_{metric}_{sub_metric}"
                    flat_scores[flat_key] = value
            else:
                flat_key = f"{difficulty_level}_{metric}"
                flat_scores[flat_key] = values
    return flat_scores

flattened_data = {}
for model, model_scores in scores_7b.items():
    flattened_data[model] = flatten_scores(model_scores)

df = pd.DataFrame(flattened_data).T
print(df)

                                  easy_count  easy_execution_accuracy  \
llama_7b_scores                         56.0                 0.000000
llama_7b_complex_scores                 56.0                 0.339286
defog_sqlcoder_7b_scores                56.0                 0.160714
defog_sqlcoder_7b_complex_scores        56.0                 0.464286
mistral_7b_instruct_scores              56.0                 0.642857

                                  easy_exact_matching_accuracy  \
llama_7b_scores                                       0.000000
llama_7b_complex_scores                               0.303571
defog_sqlcoder_7b_scores                              0.089286
defog_sqlcoder_7b_complex_scores                      0.285714
mistral_7b_instruct_scores                            0.607143

                                  easy_partial_matching_accuracy_select  \
llama_7b_scores                                                0.000000
llama_7b_complex_scores                                        0.714286
defog_sqlcoder_7b_scores                                       0.833333
defog_sqlcoder_7b_complex_scores                               0.888889
mistral_7b_instruct_scores                                     0.871795

                                  easy_partial_matching_accuracy_select(no AGG)  \
llama_7b_scores                                                        0.000000
llama_7b_complex_scores                                                0.857143
defog_sqlcoder_7b_scores                                               0.833333
defog_sqlcoder_7b_complex_scores                                       0.888889
mistral_7b_instruct_scores                                             0.897436

                                  easy_partial_matching_accuracy_where  \
llama_7b_scores                                               0.000000
llama_7b_complex_scores                                       0.666667
defog_sqlcoder_7b_scores                                      1.000000
defog_sqlcoder_7b_complex_scores                              1.000000
mistral_7b_instruct_scores                                    1.000000

                                  easy_partial_matching_accuracy_where(no OP)  \
llama_7b_scores                                                      0.000000
llama_7b_complex_scores                                              0.777778
defog_sqlcoder_7b_scores                                             1.000000
defog_sqlcoder_7b_complex_scores                                     1.000000
mistral_7b_instruct_scores                                           1.000000

                                  easy_partial_matching_accuracy_group(no Having)  \
llama_7b_scores                                                               0.0
llama_7b_complex_scores                                                       0.0
defog_sqlcoder_7b_scores                                                      0.0
defog_sqlcoder_7b_complex_scores                                              0.0
mistral_7b_instruct_scores                                                    0.0

                                  easy_partial_matching_accuracy_group  \
llama_7b_scores                                                    0.0
llama_7b_complex_scores                                            0.0
defog_sqlcoder_7b_scores                                           0.0
defog_sqlcoder_7b_complex_scores                                   0.0
mistral_7b_instruct_scores                                         0.0

                                  easy_partial_matching_accuracy_order  ...  \
llama_7b_scores                                                    0.0  ...
llama_7b_complex_scores                                            0.0  ...
defog_sqlcoder_7b_scores                                           0.0  ...
defog_sqlcoder_7b_complex_scores                                   1.0  ...
mistral_7b_instruct_scores                                         1.0  ...

                                  all_partial_matching_f1_select  \
llama_7b_scores                                         1.000000
llama_7b_complex_scores                                 0.241245
defog_sqlcoder_7b_scores                                0.064220
defog_sqlcoder_7b_complex_scores                        0.202532
mistral_7b_instruct_scores                              0.424460

                                  all_partial_matching_f1_select(no AGG)  \
llama_7b_scores                                                 1.000000
llama_7b_complex_scores                                         0.272374
defog_sqlcoder_7b_scores                                        0.064220
defog_sqlcoder_7b_complex_scores                                0.202532
mistral_7b_instruct_scores                                      0.431655

                                  all_partial_matching_f1_where  \
llama_7b_scores                                        1.000000
llama_7b_complex_scores                                0.178571
defog_sqlcoder_7b_scores                               0.043956
defog_sqlcoder_7b_complex_scores                       0.084211
mistral_7b_instruct_scores                             0.285714

                                  all_partial_matching_f1_where(no OP)  \
llama_7b_scores                                               1.000000
llama_7b_complex_scores                                       0.196429
defog_sqlcoder_7b_scores                                      0.043956
defog_sqlcoder_7b_complex_scores                              0.084211
mistral_7b_instruct_scores                                    0.285714

                                  all_partial_matching_f1_group(no Having)  \
llama_7b_scores                                                   1.000000
llama_7b_complex_scores                                           1.000000
defog_sqlcoder_7b_scores                                          1.000000
defog_sqlcoder_7b_complex_scores                                  0.038462
mistral_7b_instruct_scores                                        0.210526

                                  all_partial_matching_f1_group  \
llama_7b_scores                                        1.000000
llama_7b_complex_scores                                1.000000
defog_sqlcoder_7b_scores                               1.000000
defog_sqlcoder_7b_complex_scores                       0.038462
mistral_7b_instruct_scores                             0.210526

                                  all_partial_matching_f1_order  \
llama_7b_scores                                        1.000000
llama_7b_complex_scores                                0.030769
defog_sqlcoder_7b_scores                               1.000000
defog_sqlcoder_7b_complex_scores                       0.114286
mistral_7b_instruct_scores                             0.207792

                                  all_partial_matching_f1_and/or  \
llama_7b_scores                                         0.970443
llama_7b_complex_scores                                 0.970443
defog_sqlcoder_7b_scores                                0.970443
defog_sqlcoder_7b_complex_scores                        0.972973
mistral_7b_instruct_scores                              0.972973

                                  all_partial_matching_f1_IUEN  \
llama_7b_scores                                            1.0
llama_7b_complex_scores                                    1.0
defog_sqlcoder_7b_scores                                   1.0
defog_sqlcoder_7b_complex_scores                           1.0
mistral_7b_instruct_scores                                 1.0

                                  all_partial_matching_f1_keywords
llama_7b_scores                                           1.000000
llama_7b_complex_scores                                   0.157068
defog_sqlcoder_7b_scores                                  0.023669
defog_sqlcoder_7b_complex_scores                          0.100559
mistral_7b_instruct_scores                                0.250000

[5 rows x 165 columns]

In [98]:
mistral_7b_instruct_scores

{'easy': {'count': 56,
  'execution_accuracy': 0.6428571428571429,
  'exact_matching_accuracy': 0.6071428571428571,
  'partial_matching_accuracy': {'select': 0.8717948717948718,
   'select(no AGG)': 0.8974358974358975,
   'where': 1.0,
   'where(no OP)': 1.0,
   'group(no Having)': 0,
   'group': 0,
   'order': 1.0,
   'and/or': 1.0,
   'IUEN': 0,
   'keywords': 1.0},
  'partial_matching_recall': {'select': 0.6071428571428571,
   'select(no AGG)': 0.625,
   'where': 0.4090909090909091,
   'where(no OP)': 0.4090909090909091,
   'group(no Having)': 0.0,
   'group': 0.0,
   'order': 1.0,
   'and/or': 1.0,
   'IUEN': 0,
   'keywords': 0.5172413793103449},
  'partial_matching_f1': {'select': 0.7157894736842105,
   'select(no AGG)': 0.736842105263158,
   'where': 0.5806451612903226,
   'where(no OP)': 0.5806451612903226,
   'group(no Having)': 1,
   'group': 1,
   'order': 1.0,
   'and/or': 1.0,
   'IUEN': 1,
   'keywords': 0.6818181818181819}},
 'medium': {'count': 59,
  'execution_accuracy': 0.23728813559322035,
  'exact_matching_accuracy': 0.22033898305084745,
  'partial_matching_accuracy': {'select': 0.9473684210526315,
   'select(no AGG)': 0.9473684210526315,
   'where': 1.0,
   'where(no OP)': 1.0,
   'group(no Having)': 1.0,
   'group': 1.0,
   'order': 0.4,
   'and/or': 0.9322033898305084,
   'IUEN': 0,
   'keywords': 0.6666666666666666},
  'partial_matching_recall': {'select': 0.3050847457627119,
   'select(no AGG)': 0.3050847457627119,
   'where': 0.17391304347826086,
   'where(no OP)': 0.17391304347826086,
   'group(no Having)': 0.2727272727272727,
   'group': 0.2727272727272727,
   'order': 0.15384615384615385,
   'and/or': 1.0,
   'IUEN': 0,
   'keywords': 0.18181818181818182},
  'partial_matching_f1': {'select': 0.46153846153846156,
   'select(no AGG)': 0.46153846153846156,
   'where': 0.29629629629629634,
   'where(no OP)': 0.29629629629629634,
   'group(no Having)': 0.42857142857142855,
   'group': 0.42857142857142855,
   'order': 0.2222222222222222,
   'and/or': 0.9649122807017544,
   'IUEN': 1,
   'keywords': 0.28571428571428575}},
 'hard': {'count': 53,
  'execution_accuracy': 0.03773584905660377,
  'exact_matching_accuracy': 0.018867924528301886,
  'partial_matching_accuracy': {'select': 0.8571428571428571,
   'select(no AGG)': 0.8571428571428571,
   'where': 0.6666666666666666,
   'where(no OP)': 0.6666666666666666,
   'group(no Having)': 1.0,
   'group': 1.0,
   'order': 0.0,
   'and/or': 0.8867924528301887,
   'IUEN': 0,
   'keywords': 0.3333333333333333},
  'partial_matching_recall': {'select': 0.11320754716981132,
   'select(no AGG)': 0.11320754716981132,
   'where': 0.07692307692307693,
   'where(no OP)': 0.07692307692307693,
   'group(no Having)': 0.2,
   'group': 0.2,
   'order': 0.0,
   'and/or': 1.0,
   'IUEN': 0.0,
   'keywords': 0.03773584905660377},
  'partial_matching_f1': {'select': 0.2,
   'select(no AGG)': 0.2,
   'where': 0.13793103448275862,
   'where(no OP)': 0.13793103448275862,
   'group(no Having)': 0.33333333333333337,
   'group': 0.33333333333333337,
   'order': 1,
   'and/or': 0.9400000000000001,
   'IUEN': 1,
   'keywords': 0.06779661016949153}},
 'extra': {'count': 41,
  'execution_accuracy': 0.0,
  'exact_matching_accuracy': 0.0,
  'partial_matching_accuracy': {'select': 0.25,
   'select(no AGG)': 0.25,
   'where': 0,
   'where(no OP)': 0,
   'group(no Having)': 0,
   'group': 0,
   'order': 0,
   'and/or': 0.975609756097561,
   'IUEN': 0,
   'keywords': 0},
  'partial_matching_recall': {'select': 0.024390243902439025,
   'select(no AGG)': 0.024390243902439025,
   'where': 0.0,
   'where(no OP)': 0.0,
   'group(no Having)': 0.0,
   'group': 0.0,
   'order': 0.0,
   'and/or': 1.0,
   'IUEN': 0.0,
   'keywords': 0.0},
  'partial_matching_f1': {'select': 0.04444444444444444,
   'select(no AGG)': 0.04444444444444444,
   'where': 1,
   'where(no OP)': 1,
   'group(no Having)': 1,
   'group': 1,
   'order': 1,
   'and/or': 0.9876543209876543,
   'IUEN': 1,
   'keywords': 1}},
 'all': {'count': 209,
  'execution_accuracy': 0.24880382775119617,
  'exact_matching_accuracy': 0.22966507177033493,
  'partial_matching_accuracy': {'select': 0.855072463768116,
   'select(no AGG)': 0.8695652173913043,
   'where': 0.9375,
   'where(no OP)': 0.9375,
   'group(no Having)': 1.0,
   'group': 1.0,
   'order': 0.6153846153846154,
   'and/or': 0.9473684210526315,
   'IUEN': 0,
   'keywords': 0.7575757575757576},
  'partial_matching_recall': {'select': 0.2822966507177033,
   'select(no AGG)': 0.28708133971291866,
   'where': 0.16853932584269662,
   'where(no OP)': 0.16853932584269662,
   'group(no Having)': 0.11764705882352941,
   'group': 0.11764705882352941,
   'order': 0.125,
   'and/or': 1.0,
   'IUEN': 0.0,
   'keywords': 0.1497005988023952},
  'partial_matching_f1': {'select': 0.4244604316546762,
   'select(no AGG)': 0.4316546762589928,
   'where': 0.2857142857142857,
   'where(no OP)': 0.2857142857142857,
   'group(no Having)': 0.21052631578947367,
   'group': 0.21052631578947367,
   'order': 0.2077922077922078,
   'and/or': 0.972972972972973,
   'IUEN': 1,
   'keywords': 0.25}}}

In [99]:
def display_metrics(metrics):
    for difficulty, metrics_data in metrics.items():
        print(f"----- {difficulty.upper()} -----")
        print(f"Count: {metrics_data['count']}")
        print(f"Execution Accuracy: {metrics_data['execution_accuracy']:.2f}")
        print(f"Exact Matching Accuracy: {metrics_data['exact_matching_accuracy']:.2f}")
        
        for metric_type in ["partial_matching_accuracy", "partial_matching_recall", "partial_matching_f1"]:
            print(f"\n{metric_type.replace('_', ' ').capitalize()}:")
            for key, value in metrics_data[metric_type].items():
                print(f"  {key}: {value:.2f}")
        
        print("\n" + "-"*40)

display_metrics(mistral_7b_instruct_scores)

----- EASY -----
Count: 56
Execution Accuracy: 0.64
Exact Matching Accuracy: 0.61

Partial matching accuracy:
  select: 0.87
  select(no AGG): 0.90
  where: 1.00
  where(no OP): 1.00
  group(no Having): 0.00
  group: 0.00
  order: 1.00
  and/or: 1.00
  IUEN: 0.00
  keywords: 1.00

Partial matching recall:
  select: 0.61
  select(no AGG): 0.62
  where: 0.41
  where(no OP): 0.41
  group(no Having): 0.00
  group: 0.00
  order: 1.00
  and/or: 1.00
  IUEN: 0.00
  keywords: 0.52

Partial matching f1:
  select: 0.72
  select(no AGG): 0.74
  where: 0.58
  where(no OP): 0.58
  group(no Having): 1.00
  group: 1.00
  order: 1.00
  and/or: 1.00
  IUEN: 1.00
  keywords: 0.68

----------------------------------------
----- MEDIUM -----
Count: 59
Execution Accuracy: 0.24
Exact Matching Accuracy: 0.22

Partial matching accuracy:
  select: 0.95
  select(no AGG): 0.95
  where: 1.00
  where(no OP): 1.00
  group(no Having): 1.00
  group: 1.00
  order: 0.40
  and/or: 0.93
  IUEN: 0.00
  keywords: 0.67

Partial matching recall:
  select: 0.31
  select(no AGG): 0.31
  where: 0.17
  where(no OP): 0.17
  group(no Having): 0.27
  group: 0.27
  order: 0.15
  and/or: 1.00
  IUEN: 0.00
  keywords: 0.18

Partial matching f1:
  select: 0.46
  select(no AGG): 0.46
  where: 0.30
  where(no OP): 0.30
  group(no Having): 0.43
  group: 0.43
  order: 0.22
  and/or: 0.96
  IUEN: 1.00
  keywords: 0.29

----------------------------------------
----- HARD -----
Count: 53
Execution Accuracy: 0.04
Exact Matching Accuracy: 0.02

Partial matching accuracy:
  select: 0.86
  select(no AGG): 0.86
  where: 0.67
  where(no OP): 0.67
  group(no Having): 1.00
  group: 1.00
  order: 0.00
  and/or: 0.89
  IUEN: 0.00
  keywords: 0.33

Partial matching recall:
  select: 0.11
  select(no AGG): 0.11
  where: 0.08
  where(no OP): 0.08
  group(no Having): 0.20
  group: 0.20
  order: 0.00
  and/or: 1.00
  IUEN: 0.00
  keywords: 0.04

Partial matching f1:
  select: 0.20
  select(no AGG): 0.20
  where: 0.14
  where(no OP): 0.14
  group(no Having): 0.33
  group: 0.33
  order: 1.00
  and/or: 0.94
  IUEN: 1.00
  keywords: 0.07

----------------------------------------
----- EXTRA -----
Count: 41
Execution Accuracy: 0.00
Exact Matching Accuracy: 0.00

Partial matching accuracy:
  select: 0.25
  select(no AGG): 0.25
  where: 0.00
  where(no OP): 0.00
  group(no Having): 0.00
  group: 0.00
  order: 0.00
  and/or: 0.98
  IUEN: 0.00
  keywords: 0.00

Partial matching recall:
  select: 0.02
  select(no AGG): 0.02
  where: 0.00
  where(no OP): 0.00
  group(no Having): 0.00
  group: 0.00
  order: 0.00
  and/or: 1.00
  IUEN: 0.00
  keywords: 0.00

Partial matching f1:
  select: 0.04
  select(no AGG): 0.04
  where: 1.00
  where(no OP): 1.00
  group(no Having): 1.00
  group: 1.00
  order: 1.00
  and/or: 0.99
  IUEN: 1.00
  keywords: 1.00

----------------------------------------
----- ALL -----
Count: 209
Execution Accuracy: 0.25
Exact Matching Accuracy: 0.23

Partial matching accuracy:
  select: 0.86
  select(no AGG): 0.87
  where: 0.94
  where(no OP): 0.94
  group(no Having): 1.00
  group: 1.00
  order: 0.62
  and/or: 0.95
  IUEN: 0.00
  keywords: 0.76

Partial matching recall:
  select: 0.28
  select(no AGG): 0.29
  where: 0.17
  where(no OP): 0.17
  group(no Having): 0.12
  group: 0.12
  order: 0.12
  and/or: 1.00
  IUEN: 0.00
  keywords: 0.15

Partial matching f1:
  select: 0.42
  select(no AGG): 0.43
  where: 0.29
  where(no OP): 0.29
  group(no Having): 0.21
  group: 0.21
  order: 0.21
  and/or: 0.97
  IUEN: 1.00
  keywords: 0.25

----------------------------------------

# PyTorch Metrics